{
    "query title": "Data Scientist",
    "query location": "Chicago",
    "query time": 10,
    "query execution": "2025-04-04",
    "jobs": [
        {
            "title": "Clinical Research Data Scientist",
            "company": "Monopar Therapeutics Inc.",
            "link": "https://www.linkedin.com/jobs/view/clinical-research-data-scientist-at-monopar-therapeutics-inc-4191815057?position=1&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=lleVK9l4mO0kQai7OKYz%2BQ%3D%3D",
            "posted time": "1 week ago",
            "description": "Monopar is a growing biotech company seeking a bright, motivated, and collaborative Clinical Research Data Scientist to support the company’s late-stage rare disease and Phase 1 radiopharmaceutical pipeline. You will join a growing, talented team and will be a member of the core cross-functional team that is leading an FDA New Drug Application for Monopar’s Wilson disease candidate with significant opportunities for impact and growth.\nWhat you'll do...\nThe Clinical Research Data Scientist applies advanced data analysis and statistical methodologies to clinical trial data, synthesizes findings into clear and concise summaries for internal and external communication, and supports future commercial operations. This role will work cross-functionally with scientists, clinicians, statisticians, and management to generate actionable insights that support the company’s regulatory filings and scientific publications. The main activities include analysis and reporting of clinical trial data, creation of documentation for regulatory filings, and supporting the development of program regulatory and market initiatives.\nContribute to advancement and filing of a New Drug Application (NDA) for Monopar’s late-stage rare disease program\nReview and analyze data objectively to lead Monopar’s rare disease team toward recommendations that highlight opportunities, address potential risks, and proactively provide appropriate mitigations\nSupport statistical analysis and exploratory data analysis (EDA) to uncover insights from complex biomedical and real-world datasets\nDevelop and apply quantitative models to analyze clinical trial data, patient outcomes, and real-world evidence (RWE)\nAnalyze and interpret clinical outcomes, safety, and other program data into clear and concise summaries, diagrams and presentations\nCreate clear and effective visualizations to communicate insights to technical and non-technical audiences\nEnsure data quality, integrity, and compliance with regulatory standards.\nWork in a team-oriented setting across scientific disciplines to support overall program goals and regulatory submissions\nEffectively communicate project-related information including the planning, creation and maintenance of key metrics (e.g., timelines, deliverables, budgets)\nWork in an office (Wilmette, IL north of Chicago) with a dynamic, talented team\nWhat skills & experience you’ll bring to us…\nRequired Qualifications\nBachelor’s degree in a scientific discipline (e.g., Biology, Chemistry, Pharmaceutical Sciences, Chemical Engineering, or related field)\nA minimum of 5 years of experience in data management and/or research with a focus within the biotechnology industry\nKnowledge of FDA and ICH guidance documents and regulations\nProactive attitude with a demonstrated ability to adapt to new challenges and evolving project needs\nStrong organizational abilities with ability to manage multiple tasks simultaneously and prioritize effectively\nExcellent communication (oral and/or written) and analytical skills to facilitate clear and effective communication with internal teams and external partners\nMultitasker, self-starter, proactive, problem solver; ability to work effectively both independently and collaboratively in a team environment\nPossess a sense of curiosity and interest in science\nPreferred Qualifications\nAdvanced degree in a scientific discipline (e.g., Master’s or PhD)\nExperience supporting a successful New Drug Application\nExperience in development of investigational products with Fast Track designation, or other expedited regulatory development pathways; experience with Orphan Drug development (desirable)\nExperience in analyzing large datasets to support drug development decisions\nKnowledge of pharmaceutical regulatory guidelines and GxP compliance\nMonopar Therapeutics (NASDAQ:MNPR) is a clinical-stage biotechnology company developing a new treatment for Wilson Disease, a rare genetic disorder, and novel radiopharmaceuticals for oncology. Its pipeline includes late-stage ALXN1840, a treatment for Wilson Disease, and radiopharmaceuticals to image and treat advanced solid tumors, including Phase 1 MNPR-101-Zr for imaging as well as Phase 1 MNPR-101-Lu and late-preclinical MNPR-101-Ac for therapy.",
            "location": "Wilmette, IL"
        },
        {
            "title": "Senior Data Scientist, Full-time, Days",
            "company": "Northwestern Medicine",
            "link": "https://www.linkedin.com/jobs/view/senior-data-scientist-full-time-days-at-northwestern-medicine-4198439823?position=2&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=YCFyjR7JDSTQoPrEJLvdvw%3D%3D",
            "posted time": "3 days ago",
            "description": "Enabling digital solutions by leveraging capabilities such as AI, automation, and rollout of advanced cyber controls that support digital transformation strategies\nImplementing advanced technologies in clinical and administrative areas\nFurther develop end user support model to help enhance modern infrastructure\nAs a leader on the Data Science team, you will work with stakeholders to design, build, and evaluate solutions to business and clinical problems within the organization. You will use data, statistics, and machine learning tools to construct solutions that meet the requirements of the problem and deliver those solutions to make a tangible impact. We do not just build models; we collaborate with experts to understand and solve problems. Bring a product mindset to a technical field to design solutions that deliver value and can be maintained. Help train the rest of the team to have that same mindset.\nThis role is dedicated to the Canning Thoracic Institute and will conduct research and development as well as prototyping advanced technology solutions to enhance medical training, improve quality of care, and enable timely interventions for pulmonary and thoracic patients.\nContribute to the development of advanced technologies that enable the use of medical data across a variety of disciplines and modalities (e.g., lung sounds gathered from digital stethoscopes, electrocardiogram waveforms, videos of the airways (bronchi) in the lungs, CT imaging, clinical notes, etc.)\nMaster's degree or equivalent experience in CS, Engineering, Math, Physics, or a related field\nAt least 5 years of experience in machine learning with a focus on model building, analysis of outcomes, and model deployment\nProfessional experience using cloud platforms like Azure for scalable data processing and model deployment\nProficiency in SQL, Python, and a deep learning library like PyTorch\nStrong problem-solving skills. Able to analyze complex problems, break them down into manageable components, and develop effective solutions\nWorks well with ambiguity. Can navigate a complex problem with little guidance and still deliver results\nStrong stakeholder management skills. Experience building and growing relationships with stakeholders to ensure alignment and successful implementation of data-driven solutions\nAble to mentor the rest of the team on topics like programming, deployment, maintenance, project lifecycle, working with stakeholders, etc.\nSystems level thinking. Ability to think about how a solution will be used and identify other components that need to be built or integrated\nExperience running projects from inception to deployment. Familiar with the product development lifecycle\nExperience leading and influencing cross-functional teams\nProduct mindset. Able to identify and design solutions that solve a family of problems when relevant, as opposed to treating every problem as unique. Design systems so they can be maintained\nPhD in Computer Science, Engineering, Mathematics, or a related field\nKnowledge of audio processing techniques and algorithms\nCollect, preprocess, and augment audio datasets, converting raw audio into spectrogram images\nApply techniques like data augmentation (noise addition, time shifting, etc.) to enhance model robustness\nStrong understanding of image processing techniques and algorithms\nExperience with traditional and modern computer vision techniques (e.g. object detection, image segmentation, image, and feature extraction)\nDomain knowledge in healthcare. Understanding of healthcare terminology, workflows, and challenges, enabling effective collaboration with clinicians and healthcare professionals\nHealth care data integration experience (PHI/HIPAA, HL7 FHIR)\nFamiliarity with FDA regulation for software as a medical device\nExperience-making strategy decisions for a team while considering short- and long-term impacts",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist",
            "company": "University of Chicago",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-at-university-of-chicago-4192126245?position=3&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=G9z2SMl5P9KAzadrNyDx3g%3D%3D",
            "posted time": "1 week ago",
            "description": "Manage the program’s projects.\nDevelop frameworks for housing multi-modal clinical data – including genomic, pathology, and radiographic imaging data.\nDevelop and code data dictionaries for discrete data.\nWrite, Implement, and develop efficient code and machine learning tools and pipelines for data processing and analysis.\nWork with collaborators to implement emerging external computational tools for program data.\nDraft grant proposals.\nDevelop training material.\nKeep lab's knowledge-based trainings up to date.\nSupervise trainees.\nPerform reproducible genomic data analysis.\nCalibrates data between large and complex research and administrative datasets. Guides and may set the operational protocols for collecting and analyzing information from the University's various internal data systems as well as from external sources.\nDesigns and evaluates statistical models and reproducible data processing pipelines using expertise of best practices in machine learning and statistical inference.\nProvides expertise for high level or complex data-related requests and engages other IT resources as needed.\nAnalyzes moderately complex data sets for the purpose of extracting and purposefully using applicable information.\nProvides professional support to staff or faculty members in defining the project and applying principals of data science in manipulation, statistical applications, programming, analysis and modeling.\nPerforms other related work as needed.\nAdvanced degree in computer science.\nExperience in python including torch and scikit-learn libraries – preferred with experience in working with image data or unstructured text data with large language models.\nProficiency in Linux/Ubuntu OS including basic file and user management, ssh.\nFamiliarity with tmux, SLURM.\nStrong Analytical skills.\nProblem-solving skills.\nOrganizational skills.\nVerbal and written communication skills.\nAbility to work independently and as part of a team.\nResume (required)\nCover Letter (required)",
            "location": "Chicago, IL"
        },
        {
            "title": "Junior AI Engineer",
            "company": "Q-Centrix",
            "link": "https://www.linkedin.com/jobs/view/junior-ai-engineer-at-q-centrix-4158297234?position=4&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=m470j%2FqV6TC3LnRT1FGn9g%3D%3D",
            "posted time": "7 hours ago",
            "description": "Develop, test, and deploy LLM-powered extraction pipelines for clinical text at scale.\nAutomate prompt execution, result validation, and error handling to enhance reliability.\nMonitor and maintain production AI models, ensuring uptime, accuracy, and compliance.\nWork with product, data, engineering, and clinical teams to integrate AI outputs into real-world solutions.\nEvaluate and integrate third-party AI solutions when appropriate.\nStay current with advancements in LLM deployment, model serving, and responsible AI practices.\n1+ years of experience in LLM evaluation\nStrong software engineering foundation with proficiency in Python.\nFamiliarity with cloud platforms, data engineering and pipeline automation.\nBachelor’s degree in Computer Science, AI, a related field, or equivalent work experience.\nStrong cross-functional collaboration skills.\nProven track record of thriving in a start-up environment.\n2+ years of experience in AI deployment or applied Machine Learning.\nAdvanced degree in Computer Science or related field.\nExperience integrating AI with healthcare data (EHRs, clinical databases).\nExperience working in regulated industries with an understanding of security, compliance, and responsible AI.\nRemote/hybrid flexibility (depending on location) and a generous time off program with additional paid time for volunteering.\nRobust benefits package including medical, vision, dental, health savings accounts, company paid short- and long-term disability, employee assistance program, paid parental leave, life insurance, accident insurance, and other voluntary benefit programs for employees and their eligible dependents.\n401(k) retirement plan with a company match.\nOpportunities for professional development.",
            "location": "Chicago, IL"
        },
        {
            "title": "Star Data Scientist",
            "company": "Convey Health Solutions",
            "link": "https://www.linkedin.com/jobs/view/star-data-scientist-at-convey-health-solutions-4192153605?position=5&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=%2F70mkiyYkV6Xw2jLxM06bw%3D%3D",
            "posted time": "1 week ago",
            "description": "Position Description:\nTo create and refine real-time analytic models used to understand conversations and behaviors in order to target users with optimal messaging across different platforms and devices and to Participate in all project phases from concept, requirements, development, test and production support.\nResponsibilities:\nComplex Problem Solving - Ability to identify and solve problems by reviewing related information, evaluating options and implementing solutions\nCritical Thinking - Ability to use logic and reason to identify strengths and weaknesses of alternative solutions, conclusions, or approaches to problems\nDeductive Reasoning – Ability to apply general rules to specific problems to produce answers that make sense\nInductive Reasoning – Ability to combine pieces of information to form general rules or conclusions (includes finding a relationship among seemingly unrelated information or events)\nQuantitative and Analytical Skills - Ability to apply quantitative and statistical analysis techniques to unstructured problems\nStrong Communication Skills – Ability to clearly and concisely communicate information and ideas orally and in writing\nSkills and Experience:\nExperience with SAS, Python, or R.\n3-5 years of experience working in a data analytics capacity\nWell versed in the application of analytic techniques and predictive modeling\nPractical ability to visualize data, communicate about the data, and utilize it effectively\nInnovative instincts and an entrepreneurial spirit",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Science Analyst",
            "company": "University of Chicago",
            "link": "https://www.linkedin.com/jobs/view/data-science-analyst-at-university-of-chicago-4191510635?position=6&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=vN6SDFQE5wQyzGcu3DZDhA%3D%3D",
            "posted time": "1 week ago",
            "description": "Assist lab members with data management and compliance with funding agencies requirements.\nEvaluate past and present technologies in the literature to help develop new data analysis tools.\nWork with lab members to evaluate data and extract quantifiable metrics.\nDevelop pipelines for specific data sets (e.g. transcriptomic, proteomic, imaging) to extract significant metrics.\nPresent technical trainings, hands-on workshops, and documentation to lab members.\nAssist in creating professional graphs and figures for grants and manuscripts.\nMay assist staff or faculty members with data manipulation, statistical applications, programming, analysis and modeling on a scheduled or ad-hoc basis.\nMaintains and analyzes statistical models using general knowledge of best practices in machine learning and statistical inference. Performs maintenance on large and complex research and administrative datasets. Responds to requests and engages other IT resources as needed.\nPerforms other related work as needed.\n1+ years of work experience in data analysis.\nFluency in data manipulation and analysis.\nProficiency using statistical programming packages, such as Python and R.\nProficiency creating and presenting findings to a broad audience.\nFluency in Microsoft PowerPoint, Excel, and Word.\nExposure or experience in any of the following is a plus: Monte Carlo Simulations, Tableau, LLMs, and AutoCAD.\nDemonstrated flexibility and ability to multi-task on frequent and constantly changing demands.\nAbility to effectively communicate with faculty, graduate students and various administrative offices at all levels in the University.\nExcellent organizational skills.\nAttention to detail.\nAbility to meet deadlines.\nAbility to maintain confidentiality.\nAbility to resolves problems.\nAbility to work independently and as part of a team.\nThis is a work-from-home position, but it can be hybrid if you prefer.\nResume (required)\nCover Letter (preferred)",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist-Hybrid in Chicago",
            "company": "Rewards Network",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-hybrid-in-chicago-at-rewards-network-4149693841?position=7&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=zImSC55P6e%2BdvzWXJLms4w%3D%3D",
            "posted time": "1 week ago",
            "description": "Drive actionable insights from data and present them to external and internal clients in a compelling manner\nCollaborate across departments to understand business objectives and identify novel data-opportunities\nDevelop machine learning algorithms that support our three-way marketplace: E.g. recommendation engines, marketplace segmentation, behavioral analysis, customer retention, network optimization\nContribute to the development and maintenance of our data infrastructure to enhance the cleanliness and effectiveness of our data sources\nCreate well-determined coding and analytics packets to ensure reusability as the team expands\nCollaborate with Marketing in the design, implementation, and analysis of marketplace research\nCommunicate results to stakeholders with a focus on key takeaways and recommended actions\nIdentify novel solutions to complex problems not readily addressable by standard models\nMaster’s Degree in STEM field and 2 years of directly related experience\nPhD in related STEM field\nPython\nSQL\nExperience with any BI visualization tool\nComfortable working in a fast-paced environment\nFlexibility to tackle the changing problems at hand both big and small\nStrong written/verbal communication and presentation skills\nCode based Dev-Ops (e.g. Terraform, kubenetes, etc.)\nFamiliarity with AWS (S3, Redshift, Sagemaker)\nThis is a full-time, exempt position and the base compensation for this opening in Chicago is expected to be $100,000-120,000 annualized, depending on level, candidate experience, skills, and other factors; this position will be eligible for an annual bonus program with a target of 10% base annualized salary.\nCompetitive Paid Time Off and company holidays\nGenerous dining reimbursement when you dine with our restaurant clients\n401(k) plan with a company match\nTwo medical plan options- Standard PPO or High Deductible Health Plan (HSA with company match for HDHP participants)\nPartnership with Rx n Go, offering certain prescriptions for free\nTwo dental plan options and a vision plan\nFlexible Spending Accounts and a pre-tax commuter benefit program\nAccident, Critical Illness, and Hospital Indemnity Insurance Plans\nShort Term and Long Term disability\nCompany-paid life insurance and AD&D insurance, supplemental employee, spouse, and child life insurance\nEmployee Life Assistance Program\nHybrid working space in our state of the art office downtown located by the Metra and Ogilvie train stations. Catered lunch provided on site on Tuesday's.",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Machine Learning Engineer, Full-time, Days",
            "company": "Northwestern Medicine",
            "link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-full-time-days-at-northwestern-medicine-4198441445?position=8&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=OcwJNjJf83ZihhiJhF3i0w%3D%3D",
            "posted time": "3 days ago",
            "description": "Enabling digital solutions by leveraging capabilities such as AI, automation, and rollout of advanced cyber controls that support digital transformation strategies\nImplementing advanced technologies in clinical and administrative areas\nFurther develop end user support model to help enhance modern infrastructure\nThis role is dedicated to the Canning Thoracic Institute.\nAs a leader of the Machine Learning Engineering team, you will work with technical and nontechnical stakeholders to design, build, and manage the infrastructure, platforms, and tools that power advanced technology solutions to enhance medical training, improve quality of care, and enable timely interventions for pulmonary and thoracic patients.\nMaster’s degree or equivalent experience in Computer Science, Engineering, Mathematics, or a related field\nAt least 5 years of experience developing, scaling, or deploying machine learning models\nProfessional experience with AWS, Azure, or GCP\nAbility to drive software engineering best practices and share learnings about theoretical and technical developments in ML engineering with team members\nExperience providing technical expertise in the design and development of end-to-end technical solutions\nDemonstrable experience leading the development of reusable common frameworks, models, or components that can be leveraged to solve common ML problems\nBasic understanding of computer architecture and how it affects software performance\nDemonstrable experience with version control in a team environment\nProficiency in SQL, Python, and a deep learning framework (e.g. TensorFlow, PyTorch)\nDemonstrable professional experience with CI/CD and RESTful APIs\nBasic understanding of MLOps and associated tools (e.g. MLflow)\nHands-on experience with containerization (Docker preferred)\nA commitment to writing readable, tested, and well-documented code\nDeep understanding of fundamental computer science concepts, including data structures, algorithms, automated testing, and object-oriented programming\nDemonstrable experience working independently and managing multiple priorities\nComfortable communicating clearly and succinctly with audiences of varying technical backgrounds\nMotivated by a curiosity for understanding how complex systems work\nAbility to teach and mentor others\nPhD in Computer Science, Engineering, Mathematics, or a related field\nHealth care data integration experience (PHI/HIPAA, HL7 FHIR)\nFamiliarity with FDA regulation for software as a medical device\nProduction experience with Databricks, Spark, and/or Kubernetes\nKnowledge of audio processing workflows and models\nKnowledge of computer vision workflows and models\nFamiliarity with asynchronous programming patterns\nFamiliarity with GitHub or Azure DevOps\nHands-on experience with Terraform\nExperience with C, C++, C#, or Go\nHealthcare experience\nEpic experience",
            "location": "Chicago, IL"
        },
        {
            "title": "Artificial Intelligence (AI) Developer",
            "company": "Milliman",
            "link": "https://www.linkedin.com/jobs/view/artificial-intelligence-ai-developer-at-milliman-4181857702?position=9&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=MmyMqj%2FdjV97HwV32Yz52A%3D%3D",
            "posted time": "10 hours ago",
            "description": "Architect, design, and develop both frontend and backend components of AI-driven web applications.\nBuild responsive, user-friendly interfaces using modern JavaScript frameworks (e.g., React, Angular, or Vue.js) and robust backend services (e.g., Node.js, Django, or .NET).\nDevelop and integrate secure RESTful and GraphQL APIs to connect AI models with cloud services and third-party systems.\nLeverage cloud platforms (AWS, Azure, or GCP) to deploy and manage scalable applications and services.\nCollaborate with data scientists to integrate machine learning models, natural language processing, computer vision, and other AI techniques into web applications.\nOptimize AI workflows by ensuring seamless data exchange and efficient model inference across the technology stack.\nImplement CI/CD pipelines, containerization (e.g., Docker, Kubernetes), and automated testing to ensure efficient, reliable releases.\nMonitor application performance and troubleshoot issues in real time to maintain high-quality production environments.\nWork closely with cross-functional teams to gather requirements, deliver project updates, and ensure solutions align with business needs.\nDocument development processes, API specifications, and integration practices to support future enhancements and maintenance.\nBachelor’s degree in Computer Science, Data Science, Engineering, or a related field.\nThe ideal candidate must have minimum 5 years of experience with full stack development and minimum 2 years with AI development.\nThe ideal candidate must have hands on experience in multiple programming languages, including Python, JavaScript (or TypeScript), and/or C#.\nThe ideal candidate must have hands on experience with front-end frameworks (e.g., React, Angular, or Vue.js) and backend development (e.g., Node.js, Django, or .NET).\nThe ideal candidate must have an In-depth knowledge of cloud platforms (AWS, Azure, or GCP) and experience building and integrating cloud APIs.\nThe ideal candidate must have hands-on experience with containerization and orchestration tools (Docker) and version control systems (Git).\nThe ideal candidate must have hands-on experience with data management, including data transformation and storage.\nMust have an understanding of AI ethics, model interpretability, and scalable AI deployment practices.\nMust have strong problem-solving, analytical, and communication skills.\nMust have the ability to work effectively both independently and as part of a collaborative, agile team.\nMust be detail-oriented with strong organizational skills and a passion for continuous learning and innovation.\nMaster's degree or higher in a relevant field.\nExperience with NLP, computer vision, or reinforcement learning.\nFamiliarity with MLOps practices and tools.\nExperience with machine learning frameworks (e.g., TensorFlow, PyTorch, or Scikit-learn) and data processing libraries (e.g., Pandas, NumPy).\nPrior experience in developing enterprise-level full-stack applications and cloud-native solutions.\nExposure to agile methodologies and DevOps best practices.\nMedical, Dental and Vision - Coverage for employees, dependents, and domestic partners.\nEmployee Assistance Program (EAP) - Confidential support for personal and work-related challenges.\n401(k) Plan - Includes a company matching program and profit-sharing contributions.\nDiscretionary Bonus Program – Recognizing employee contributions.\nFlexible Spending Accounts (FSA) - Pre-tax savings for dependent care, transportation, and eligible medical expenses.\nPaid Time Off (PTO) - Begins accruing on the first day of work;\nFull-time employees accrue 15 days per year.\nEmployees working less full-time accrue PTO on a prorated basis.\nHolidays - A minimum of 10 observed holidays per year.\nFamily Building Benefits including Adoption and fertility assistance.\nPaid Parental Leave - Up to 12 weeks of paid leave for employees who meet eligibility criteria.\nLife Insurance & AD&D - 100% of premiums covered by Milliman.\nShort-Term and Long-Term Disability – Fully paid by Milliman.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist, People Experience",
            "company": "Slalom",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-people-experience-at-slalom-4146107335?position=10&pageNum=0&refId=ayKmoU7Bjry2xBgDidTYFw%3D%3D&trackingId=DQpTJcWJY9EkOLGeipNlPA%3D%3D",
            "posted time": "1 week ago",
            "description": "Lead advanced data-driven initiatives within the Talent & People Experience team, driving improvements across hiring, staffing, and workforce planning.\nElevate Slalom’s people capabilities through optimizing staffing processes, understanding attrition and retention drivers, identifying and rewarding top performers, and designing personalized professional development journeys.\nConduct ad-hoc analyses on key workforce metrics (e.g., relationship between team tenure and engagement) while also managing longer-term projects such as predicting future client demand and recommending workforce strategies.\nCollaborate with executives and key stakeholders to transform business questions into impactful data insights and products that inform strategic decisions.\nLeverage modern cloud-based data platforms, predictive analytics, and data visualization tools to deliver high-impact insights that drive people-focused outcomes across Slalom.\nPartner with data scientists, analysts, architects, and engineers in a collaborative environment to enhance organizational excellence.\nContribute to the evolution of Slalom’s customized data science tools, integrating AI technologies to optimize and scale analytical processes.\nCreate and maintain data visualizations and client ready dashboards to effectively communicate findings.\nAdvanced proficiency in Python, including expertise in data science (e.g., Pandas, Polars, NumPy, SciPy), data visualization (e.g., Matplotlib, Seaborn, Plotly), and reporting automation (e.g., xlwings, python-pptx) packages.\nExperience with cloud platforms (e.g., AWS) and modern data science tools (e.g., SageMaker, ClearML, Lightning.ai).\nProven success in a diverse range of data science initiatives including ad-hoc analyses, rapid prototyping, predictive modeling, and full-scale model development, testing, and deployment.\nStrong ability to transform data into strategic insights and communicate effectively to both technical and executive audiences.\nAbility to translate complex, ambiguous problems into actionable insights—asking the right questions, diving into the details, and bringing clarity through data.\nBaseline proficiency in SQL for data retrieval, joining, aggregation, and filtering.\nExperience with software engineering best practices, such as Git for collaboration and version control.\nFamiliarity with modern AI tools and large language models (LLMs) for accelerating data analysis and project delivery.\nDashboarding experience with tools like Power BI or Tableau, and familiarity with Snowflake is desirable.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist",
            "company": "Ovative Group",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-at-ovative-group-4198864314?position=1&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=qSC0sirfwG3qHlOHAEZcJA%3D%3D",
            "posted time": "1 day ago",
            "description": "Developing and advancing marketing measurement capabilities that unlock our company vision to transform the measure of marketing success in the industry. You will be at the forefront of developing and delivering differentiated marketing data science and measurement solutions that include maximizing profitable enterprise revenue and customer value for our clients.\nPartnering with driven, solution-minded experts, business leaders, analysts, and other data scientists at Ovative in engaging with clients and defining approaches and road maps for solutions to business problems.\nWorking in a team with technology leaders, product owners and engineers to convert novel solutions to scalable new services and products at Ovative.\nBeing a part of an inclusive culture that inspires and motivates the team and attracts new, diverse technical talent to the organization.\nTechnical contributor in a high-performance multi-disciplinary team of data scientists, data engineers and product managers, and bringing in executional excellence to elevate the entire product space.\nDrive value across multiple business verticals by contributing to the technical development and deployment of impactful and interpretable algorithms related to Media Mix Models and Forecasting.\nCommunicating the results of your DS work to technical and non-technical stakeholders.\nServe as the trusted data science consult and expert to internal stakeholder teams\n2-5 Years of data science/analytics experience\nRobust programming experience with key languages like R (preferably) and/or Python and SQL.\nDeploying machine learning models, understanding of Frequentist and Bayesian Paradigms, good principles of model building, interpretability and applicability, strong understanding of mathematical principles and statistics\nFamiliarity with Data Science tech stack and tools for Code versioning (Git), Containerization (Docker), Cloud (Google Cloud Platform)\nEffective communication skills for technical and non-technical audiences\nAn Entrepreneurial Mindset that leads to problem solutions with speed and multi-disciplinary collaboration\nPreferred qualifications: Prior focus on digital marketing analytics\nAccess to all office spaces in MSP, NYC, and CHI\nFrequent, paid travel to our Minneapolis headquarters for company events, team events, and in-person collaboration with teams.\nFlexible paid vacation policy\n401k match program\nTop-notch health insurance options\nMonthly stipend for your mobile phone and data plan\nSabbatical program\nCharitable giving via our time and a financial match program\nShenanigan’s Day",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist",
            "company": "Jerry",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-at-jerry-4199459097?position=2&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=elB0fvQ9MGL6vdEwgLHWXw%3D%3D",
            "posted time": "6 hours ago",
            "description": "Join a pre-IPO startup with capital, traction and runway ($240M funded | 60X revenue growth in 5 years | $2T market size)\nReport directly to our Director of BizOps & Analytics, Qingdi Huang (Ex-Bain)\nDisrupt a massive market and take us to a $10B business in the next few years\nBe immersed in a talent-dense environment and greatly accelerate your career growth\nPartner with marketing, product, and business development teams to integrate customer performance insights into user and partner acquisition strategies\nLead the design, execution, and analysis of A/B experiments on new and existing features, extracting key insights to inform product and business strategies\nDefine, understand, and test levers to drive profitable and scalable user acquisition and partnership growth\nIdentify opportunities to automate manual processes and optimize operational efficiency\nBachelor’s degree in a quantitatively or intellectually rigorous discipline\n1-3 years of management consulting experience from a top firm (McKinsey, Bain, and Boston Consulting Group preferred) OR relevant experience in data science/business analysis\nHigh level of comfort with SQL or Python\nYou have a framework for problem solving and live by first principles\nYou are comfortable communicating with audiences varying from front-line employees to the company’s C-suite\nYou set a very high bar for yourself and for your team, and you are constantly pushing that bar higher in the pursuit of excellence",
            "location": "Chicago, IL"
        },
        {
            "title": "Machine Learning and Algorithm Developer",
            "company": "Belvedere Trading, LLC",
            "link": "https://www.linkedin.com/jobs/view/%E2%80%8Bmachine-learning-and-algorithm-developer%E2%80%8B-at-belvedere-trading-llc-4197388888?position=3&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=DBo803v45RbcY0%2BCMrt%2Ffw%3D%3D",
            "posted time": "4 days ago",
            "description": "Data quality and management - Integrate data from multiple sources and validate data quality on BigQuery to ensure stable analytical capabilities.\nData analysis - Create and maintain visualization tools using SQL, jupyter notebooks, and Grafana dashboards to draw insights to inform trading decisions.\nResearch - Propose and train machine learning models catered to market making operations using python and jupyter notebooks, obtain data from curated data sets with SQL and integrate models into real-time algorithms to build scalable and intelligent trading system.\nCollaboration and innovation - Work closely with Software Engineers, Quantitative Analysts and Researchers to understand trading concepts, generate ideas to solve complex problems and implement solutions that will be used to drive future decision making.\nWork closely with senior industry leaders as part of a small and focused team based in the Boulder office.\nMaster’s degree in Computer Science, AND 1-month internship or other occupation utilizing machine learning frameworks and requiring use of Python.\nFull time position.\nMultiple positions available.\nJobsite: 10 S. Riverside Plaza, Suite 2100, Chicago, IL 60606.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist / Senior Data Scientist, Analytics",
            "company": "DoorDash",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-senior-data-scientist-analytics-at-doordash-3987288044?position=4&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=4chplkd4ENYPKKVoK%2F9hLQ%3D%3D",
            "posted time": "3 days ago",
            "description": "Consumer & Growth\nBusiness Operations\nDasher & Logistics\nCustomer Experience & Integrity\nMerchant, Ads & Sales\nNew Verticals\nInternational Data Science\nUse quantitative analysis and the presentation of data to see beyond the numbers and understand what drives our business\nBuild full-cycle analytics experiments, reports, and dashboards using SQL, R, Python, or other scripting and statistical tools\nWork with and mentor junior analysts on how to use more advanced methods and solve challenges\nProduce recommendations and use statistical techniques and hypothesis testing to validate your findings\nProvide insights to help business and product leaders understand marketplace dynamics, user behaviors, and long-term trends\nIdentify and measure levers to help move essential metrics and make recommendations\nWork backwards from understanding and sizing problems to ideating solutions\nReport against our goals by identifying essential metrics and building executive-facing dashboards to track progress\nCollaborate with engineering to implement, document, validate, and monitor our logging\nA degree in Math, Physics, Statistics, Economics, Computer Science, or a similar domain\n2+ years of experience in data analytics, consulting, or related role\nExperience working with funnel optimization, user segmentation, cohort analyses, time series analyses, regression models, etc\nExpertise of SQL queries, ETL, A/B Testing, and statistical analysis (e.g. hypothesis testing, experimentation, regressions) with statistical packages, such as Matlab, R, SAS or Python\nProficiency in one or more analytics & visualization tools (e.g. Chartio, Looker, Tableau)\nThe insight to take ambiguous problems and solve them in a structured, hypothesis-driven, data-supported way",
            "location": "Chicago, IL"
        },
        {
            "title": "Decision Scientist",
            "company": "CVS Health",
            "link": "https://www.linkedin.com/jobs/view/decision-scientist-at-cvs-health-4197825861?position=5&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=JEgmrALy6XMpObDlV1t%2Bag%3D%3D",
            "posted time": "3 days ago",
            "description": "Identify, analyze, and interpret trends or patterns in complex data sets\nPrepares and disseminates analysis reports, and presentations to various audiences both internal and external\nCollaborates with internal program staff around all evaluation and analysis activities\nHandles all data requests and special analyses for internal and external partners\nAssists in developing actionable metrics to quantify the impact of programming\nEstablishes relationships with internal and external partners to obtain and validate quality data\nAssists in creating uniform business rules that will be used in all ad-hoc analyses\nOther duties as assigned.\nUndergraduate degree, preferably in Computer Science, Business or Analytics\n2 or more years of relevant work experience\nProficient in writing SQL queries and stored procedures on large data sets with complex data models\nAdvanced Microsoft Excel skills (PowerPivot, functions, VBA)\nData management experience; knowledgeable in database rules, writing queries, and relational database creation and management (create, query, relate)\nAn analytical mind and inclination for problem-solving\nAbility to manage deadlines and deliverables and communicate them to business owners\nAbility to communicate clearly to stakeholders\nBusiness process understanding\nUS work authorization\nSomeone who embodies being \"Oaky\"\nRadiating positive energy\nAssuming good intentions\nCreating an unmatched patient experience\nDriving clinical excellence\nTaking ownership and delivering results\nBeing relentlessly determined\nMission-focused career impacting change and measurably improving health outcomes for medicare patients\nPaid vacation, sick time, and investment/retirement 401K match options\nHealth insurance, vision, and dental benefits\nOpportunities for leadership development and continuing education stipends\nNew centers and flexible work environments\nOpportunities for high levels of responsibility and rapid advancement\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.",
            "location": "Chicago, IL"
        },
        {
            "title": "Machine Learning/AI Engineer - Remote Sensing / Geospatial",
            "company": "Attis",
            "link": "https://www.linkedin.com/jobs/view/machine-learning-ai-engineer-remote-sensing-geospatial-at-attis-4197887517?position=6&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=98OTizv%2F6741E3d7eKqkcg%3D%3D",
            "posted time": "3 days ago",
            "description": "Machine Learning/AI Engineer - Remote Sensing / Geospatial\nOverview: My client, an innovative technology-focused organization within the Built Environment sector, is seeking a talented and driven Machine Learning/AI Engineer. This is a unique opportunity to contribute to impactful projects focused on leveraging advanced analytics on spatial and visual data to generate critical insights for the industry. If you are passionate about applying cutting-edge AI/ML techniques to solve complex analytical challenges involving location-based and image-based information within the context of Built Environment, this could be the perfect role for you.\nWhy Join?: Join a forward-thinking organization that is utilizing advanced analytical methods to understand and optimize various aspects of the Built Environment. You will be part of a collaborative and passionate team of professionals, working on projects that are at the forefront of applying AI to real-world scenarios involving spatial and visual understanding within this dynamic sector. This role offers the chance to engage in meaningful work that leverages advanced AI to extract knowledge from rich data sources relevant to the design, construction, and management of our physical surroundings.\nCompensation: Base salary between $180,000 - $200,000 depending on experience, plus further benefits.\nLocation: This role offers a preference for candidates located in the Chicago, IL area, but is a remote position.\nThe Role: As a Machine Learning/AI Engineer, you will be instrumental in developing and implementing AI models that focus on the analysis of spatial and visual data within the Built Environment. You will collaborate closely with product managers, data scientists, and other technical experts to design and deploy innovative AI-powered analytical solutions relevant to this sector. Your responsibilities will include evaluating and refining existing AI algorithms to ensure optimal performance in processing complex spatial and visual information, staying informed about the latest advancements in AI/ML relevant to these domains, and potentially contributing to the broader technical community.\nThe Essential Requirements\nBachelor’s degree in Computer Science, Data Science, Artificial Intelligence, or a related field; advanced degree preferred.\nProven experience working with remote sensing / imaging data. I.e. Optical (Hyperspectral/Multispectral) SAR, IR, RF, LiDAR, etc…\nDemonstrable experience in machine learning and AI, specifically in developing models for spatial data analysis and computer vision tasks.\nStrong proficiency in Python and relevant frameworks such as PyTorch, Keras, and TensorFlow.\nExperience working with Computer Vision and Vision-Language Models (VLM).\nFamiliarity with cloud platforms such as AWS and GCP for AI workloads.\nExcellent problem-solving abilities and the capacity to work effectively both independently and within a team.\nIf you are interested in this role, please apply with your resume through this site.\nDisclaimer\nAttis Global Ltd is an equal opportunities employer. No terminology in this advert is intended to discriminate on any of the grounds protected by law, and all qualified applicants will receive consideration for employment without regard to age, sex, race, national origin, religion or belief, disability, pregnancy and maternity, marital status, political affiliation, socio-economic status, sexual orientation, gender, gender identity and expression, and/or gender reassignment. M/F/D/V. We operate as a staffing agency and employment business. More information can be found at attisglobal.com.\nSEO Keywords for Search\nMachine Learning Engineer Built Environment, AI Engineer Built Environment, Artificial Intelligence Engineer Built Environment, ML Engineer Built Environment, Computer Vision Engineer Built Environment, Spatial Data Analysis Built Environment, Geospatial Analysis Built Environment, Remote Machine Learning Engineer Built Environment, Chicago AI Engineer Built Environment, Location Data Analysis Built Environment, Image Analysis Engineer Built Environment, Large Language Models Engineer, VLM Engineer, Generative Models Engineer, Python Machine Learning, PyTorch Engineer, TensorFlow Engineer, Keras Engineer, AWS AI Engineer, GCP AI Engineer, Data Scientist with Spatial Data Built Environment, Data Scientist with Image Recognition Built Environment.",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Data Scientist",
            "company": "University of Chicago",
            "link": "https://www.linkedin.com/jobs/view/senior-data-scientist-at-university-of-chicago-4190901359?position=7&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=873JULv7wyNjDrtkeG%2BPGA%3D%3D",
            "posted time": "1 week ago",
            "description": "Supports Mansueto Institute research at all stages: conception, data collection and cleaning, research design, analysis, visualization, and write up.\nHelps prepare and co-author academic papers, research briefs, presentations, and external other publications targeting both policymakers and researchers.\nConducts large and small-scale management and analysis of geospatial data, which includes data from a range of different sources, such as statistical agencies, municipal governments, and the proprietary datasets.\nWorks with partners and members of the research team to propose and implement analytical approaches to solving specific research questions.\nWorks with local, national, and international data repositories and historical datasets to support or advance research.\nDesigns and builds statistical models for a variety of research projects.\nAssists with representing the Institute and serves as liaison to new and existing partners, both internally and externally.\nAttends and contributes to research team meetings as well as University of Chicago seminars and workshops, as appropriate.\nOversees the development and deployment of computational workflows of and reviews code for consistency and quality.\nApplies research principles and relevant subject matter knowledge relevant to administer a research project. With a moderate level of direction, manages lab and/or research-related duties and tasks. Helps develop, design and conduct research projects according to plan.\nSupports data collection and analytical needs of research projects. Conducts literature reviews and helps write reports and manuscripts. Ensures project compliance with different policies, procedures, directives, and mandates.\nPerforms other related work as needed.\nBachelor's degree.\nMaster’s degree or higher in a technical field of study, such as data science, computer science, statistics, or a quantitative social science.\nRelevant technical work experience through education or prior employment.\nDrafting and delivering research results, ideally in an academic or policy context.\nProject management experience.\nComputing and analysis experience with various datasets using standard industry software such as Python, Stata, and R.\nProficient with statistical analysis applied to GIS data.\nConceptual and practical expertise in applied statistics and research design, including causal inference and predictive modeling.\nCommunicate technical analyses to a non-technical audience through accessible writing and visualization.\nUnderstand and translate researchers' scientific goals into actionable analytical work plans.\nWork well with faculty and researchers.\nIdentify and gain expertise in appropriate new technologies, methods, and/or software tools as needed.\nStrong analytical thinking and problem-solving ability.\nPerform at a high level as part of an interactive multi-disciplinary team including faculty, students and other researchers while demonstrating self-initiative to achieve project’s goals and align them with the Mansueto Institute’s mission.\nFluency in data organization, manipulation and analysis.\nA passion for understanding cities and what makes them successful.\nResume/CV (required)\nCover Letter (required)\nAnalytical Writing Sample, research paper or report written for a course or work assignment acceptable (required)",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Data Scientist (Remote)",
            "company": "PriceLabs",
            "link": "https://www.linkedin.com/jobs/view/senior-data-scientist-remote-at-pricelabs-4194738920?position=8&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=3KG4T6Z4uhfEKyGNstSsTw%3D%3D",
            "posted time": "1 week ago",
            "description": "Our team grew 3x\nWe raised $30 million in funding from Summit Partners\nWe joined hands with Rental Scale-Up to deliver in-depth market insights and actionable news to hosts & property managers\nWork with an industry-leading product that has thousands of customers worldwide, and our customers love the product! (NPS in the 70s, Customer reviews here)\nWork with a global team (8 countries and counting) of passionate individuals that accept open communication, empowerment, and a shared focus on customer success.\nWe are a freemium product, so marketing leads the charge on customer acquisition.\nWe are a remote-first organization and accept work from home as the norm.\nDesign, develop and enhance our pricing algorithms to enable new capabilities.\nProcess, analyse, model, and visualise findings from our market-level supply and demand data.\nBuild and enhance internal and customer-facing dashboards to better track metrics and trends that help customers use PriceLabs in a better way.\nTake ownership of product ideas and design discussions.\nOccasional travel to conferences to interact with prospective users and partners, and learn where the industry is headed.\nYou have a minimum of seven (7) years of relevant experience.\nStrong understanding of analysis of algorithms, data structures and statistics.\nSolid programming experience. Including being able to quickly prototype an idea and test it out.\nStrong communication skills, including the ability and willingness to explain complicated algorithms and concepts in simple terms.\nExperience with relational databases and strong knowledge of SQL.\nExperience building data-heavy analytical models in the travel industry.\nPrior experience working in a fast-paced environment.\nWillingness to wear many hats.\nMasters/ or Ph. D. in Economics or Statistics.\nExperience in the vacation rental industry.\nExperience developing dynamic pricing models.",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Data Scientist, Full-time, Days",
            "company": "Northwestern Memorial Hospital",
            "link": "https://www.linkedin.com/jobs/view/senior-data-scientist-full-time-days-at-northwestern-memorial-hospital-4197594807?position=9&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=IfAWc%2BFrwUusVERnAtWYmg%3D%3D",
            "posted time": "1 day ago",
            "description": "Enabling digital solutions by leveraging capabilities such as AI, automation, and rollout of advanced cyber controls that support digital transformation strategies\nImplementing advanced technologies in clinical and administrative areas\nFurther develop end user support model to help enhance modern infrastructure\nAs a leader on the Data Science team, you will work with stakeholders to design, build, and evaluate solutions to business and clinical problems within the organization. You will use data, statistics, and machine learning tools to construct solutions that meet the requirements of the problem and deliver those solutions to make a tangible impact. We do not just build models; we collaborate with experts to understand and solve problems. Bring a product mindset to a technical field to design solutions that deliver value and can be maintained. Help train the rest of the team to have that same mindset.\nThis role is dedicated to the Canning Thoracic Institute and will conduct research and development as well as prototyping advanced technology solutions to enhance medical training, improve quality of care, and enable timely interventions for pulmonary and thoracic patients.\nContribute to the development of advanced technologies that enable the use of medical data across a variety of disciplines and modalities (e.g., lung sounds gathered from digital stethoscopes, electrocardiogram waveforms, videos of the airways (bronchi) in the lungs, CT imaging, clinical notes, etc.)\nMaster's degree or equivalent experience in CS, Engineering, Math, Physics, or a related field\nAt least 5 years of experience in machine learning with a focus on model building, analysis of outcomes, and model deployment\nProfessional experience using cloud platforms like Azure for scalable data processing and model deployment\nProficiency in SQL, Python, and a deep learning library like PyTorch\nStrong problem-solving skills. Able to analyze complex problems, break them down into manageable components, and develop effective solutions\nWorks well with ambiguity. Can navigate a complex problem with little guidance and still deliver results\nStrong stakeholder management skills. Experience building and growing relationships with stakeholders to ensure alignment and successful implementation of data-driven solutions\nAble to mentor the rest of the team on topics like programming, deployment, maintenance, project lifecycle, working with stakeholders, etc.\nSystems level thinking. Ability to think about how a solution will be used and identify other components that need to be built or integrated\nExperience running projects from inception to deployment. Familiar with the product development lifecycle\nExperience leading and influencing cross-functional teams\nProduct mindset. Able to identify and design solutions that solve a family of problems when relevant, as opposed to treating every problem as unique. Design systems so they can be maintained\nPhD in Computer Science, Engineering, Mathematics, or a related field\nKnowledge of audio processing techniques and algorithms\nCollect, preprocess, and augment audio datasets, converting raw audio into spectrogram images\nApply techniques like data augmentation (noise addition, time shifting, etc.) to enhance model robustness\nStrong understanding of image processing techniques and algorithms\nExperience with traditional and modern computer vision techniques (e.g. object detection, image segmentation, image, and feature extraction)\nDomain knowledge in healthcare. Understanding of healthcare terminology, workflows, and challenges, enabling effective collaboration with clinicians and healthcare professionals\nHealth care data integration experience (PHI/HIPAA, HL7 FHIR)\nFamiliarity with FDA regulation for software as a medical device\nExperience-making strategy decisions for a team while considering short- and long-term impacts",
            "location": "Chicago, IL"
        },
        {
            "title": "PhD Data Scientist, New Grad",
            "company": "Stripe",
            "link": "https://www.linkedin.com/jobs/view/phd-data-scientist-new-grad-at-stripe-4107168460?position=10&pageNum=1&refId=ccfnWYwrSCO0R8%2B%2BICmV4Q%3D%3D&trackingId=yTyEUkZ7v1dUkVhgdT5wZg%3D%3D",
            "posted time": "3 days ago",
            "description": "Enrolled in a quantitative PhD program (e.g. Mathematics, Engineering, Computer Science, Statistics, or Economics) with the expectation of graduating in winter 2024 or spring/summer 2025\nExperience with a scientific computing language (such as Python, R, etc) and SQL. We believe new programming languages can be learned if the fundamentals and general knowledge are present!\nKnowledge and hands-on experience in several of the following areas: machine learning, statistics, optimization, product analytics, causal inference, and/or experimentation\nExperience communicating and collaborating with multidisciplinary stakeholders in a team environment\nAbility to communicate results clearly and a focus on driving impact\nA demonstrated ability to manage and deliver on multiple projects with a high attention to detail\nSolid business acumen and experience in synthesizing complex analyses into actionable recommendations\nA builder's mindset with a willingness to question assumptions and conventional wisdom\nExperience writing and debugging data pipelines\nDemonstrated ability to evaluate and receive feedback from mentors, peers, and stakeholders via experience from previous internships or other multi-person projects\nAbility to learn new systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts\nThis role is not eligible for hire in the Greater Seattle Area, San Francisco Bay Area, or New York City. We are hiring these positions in Chicago, IL or Toronto, Ontario, Canada.",
            "location": "Chicago, IL"
        },
        {
            "title": "Machine Learning Scientist, Digital Pathology",
            "company": "Tempus AI",
            "link": "https://www.linkedin.com/jobs/view/machine-learning-scientist-digital-pathology-at-tempus-ai-4197474972?position=1&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=I3XynVF7u7n8UM4aHQpP0A%3D%3D",
            "posted time": "3 days ago",
            "description": "Develop and Implement AI/ML Models: Design, train, and validate machine learning models for analyzing digital pathology images (whole-slide images) to perform tasks like biomarkers and outcomes prediction.\nAlgorithm Validation and Deployment: Validate ML/AI algorithms analytically and/or clinically, and deploy them into existing workflows or production environments.\nData Analysis and Curation: Work with large-scale pathology datasets, ensuring data quality and integrity, collecting annotations, and preprocessing for model training and evaluation.\nCollaboration: Collaborate with a multidisciplinary team including pathologists, biologists, statisticians, data analysts, and engineers to integrate AI solutions and transform health care.\nResearch and Innovation: Stay updated on the latest advancements in AI, machine learning, digital pathology, and multi-modal healthcare to contribute to ongoing projects and identify new opportunities.\nBiomarker Discovery: Assist in identifying biomarkers from histopathology and spatial omics data to support patient stratification and companion diagnostic efforts.\nPh.D. (or MS and 2+ years of working experience) in Computer Science, Artificial Intelligence, Data Science, Computational Biology, or a related field. A strong academic background with a focus on imaging for healthcare applications is preferred.\nSolid knowledge of machine learning concepts, including deep learning, optimization algorithms, regularization techniques, weakly supervised learning and self-supervised learning.\nExtensive experience in developing and implementing imaging AI models, such as ViT, CNNs, Unet, and related architectures including tasks such as classification, segmentation or detection.\nOutstanding analytical and problem-solving skills, with a particular focus on understanding the intricacies of multi-modal medical datasets.\nProficiency in programming languages and packages commonly used in AI research, such as Python and PyTorch / Tensorflow.\nStrong collaboration and communication abilities.\nTrack record in publications, patents, and/or launched products in this space.\nExperience in pre-training and fine-tuning unimodal or multimodal foundation models.\nExperience working with histopathology images, DNA/RNA molecular sequencing data or clinical data (structured EHRs, clinical notes).\nExperience working in an industry setting.",
            "location": "Chicago, IL"
        },
        {
            "title": "Research Science Analyst, Finalta",
            "company": "Finalta by McKinsey",
            "link": "https://www.linkedin.com/jobs/view/research-science-analyst-finalta-at-finalta-by-mckinsey-4195329977?position=2&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=jHiWGsgd34rEUigMAgOKEw%3D%3D",
            "posted time": "1 week ago",
            "description": "Bachelor’s degree/master's degree in a related field\n18+ months of experience in data analytics, strategy, financial services or consultancy\nStrong analytical skills and problem-solving capabilities\nGreat interpersonal communication skills; exceptional ability in writing and client-management\nAbility to manage your time to produce high quality work according to deadlines\nFluency in English, both written and verbal",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Scientist",
            "company": "Hilco Global",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-at-hilco-global-4174533460?position=3&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=%2BKUjipy9P4NS4AhKr17xbw%3D%3D",
            "posted time": "1 week ago",
            "description": "Leadership & Strategy\nDevelop and execute a comprehensive data science strategy that aligns with HCR’s business objectives and investment priorities.\nIdentify opportunities for data-driven improvements by collaborating with cross-functional teams, including finance, technology, and HCR business units.\nLead the integration of advanced analytics and AI-driven decision-making across business strategies, operational workflows, and monetization initiatives.\nAdvise & Influence senior leadership and external stakeholders by providing thought leadership on how data science can create competitive advantages.\nData Science & Advanced Analytics\nDevelop and deploy predictive and prescriptive models to inform business strategy, risk assessments, and yield/performance optimization.\nApply machine learning, AI, and econometric modeling to identify patterns and forecast financial and market trends.\nConduct A/B testing and statistical analysis to evaluate the effectiveness of pricing, monetization, and operational strategies.\nData Engineering & Infrastructure\nLeverage data science to provide quantitative support for investment decisions and business strategies.\nPartner with financial analysts and business leaders to transform complex datasets into meaningful insights that influence decision-making.\nSupport development of real-time data visualizations and dashboards that track performance metrics and operational KPIs.\n5+ years' experience in Data Science/Data Analytics\nMust be able to commute to Northbrook, IL on a hybrid schedule\nProficiency in Python, R, SQL, and experience with machine learning frameworks (TensorFlow, Scikit-learn, PyTorch).\nFinancial & Market Acumen – Strong understanding of financial modeling, investment analytics, risk assessment, and consumer behavior trends.\nData Engineering Skills – Experience working with big data platforms (Snowflake, AWS, Azure, Google Cloud, Spark) and managing data pipelines.\nStrong ability to translate complex data insights into executive-level recommendations using tools like Tableau, Power BI, or D3.js.\nProblem-Solving Mindset – Comfortable tackling complex, ambiguous business challenges and delivering data-driven solutions.\nJoin a firm with four decades of expertise in capital partnerships, financial advisory, and investment solutions.\nWork at the intersection of finance, technology, and strategy, using data science to drive business transformation.\nTackle high-impact, real-world business challenges in retail, consumer goods, and financial markets.\nBe part of a data-driven culture that values innovation, insights, and cutting-edge technology.",
            "location": "Northbrook, IL"
        },
        {
            "title": "Data Scientist",
            "company": "SDG Group USA",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-at-sdg-group-usa-4196908692?position=4&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=u3d80XDQ2LneRln7rNHT0w%3D%3D",
            "posted time": "3 days ago",
            "description": "About the Company and the Position 🚀\nSDG Group is a global consulting firm focused exclusively on data & analytics solutions, covering the entire data value chain, and providing both consulting and specialization career plans for all those who want to progress in the world of data. In addition, through our Smart Work culture you will have the possibility to define the work model that best suits you and your personal needs, while at the same time being able to collaborate on high-impact initiatives for leading clients in their respective industries.\nAs a Data Scientist in the Data Science area, your mission will be to be part of multidisciplinary teams with the aim of helping our clients develop machine learning and artificial intelligence solutions in environments of high technical complexity, and with an end-to-end vision: from initial business analysis and experimentation, to the implementation of advanced analytics systems.\nYou will have the possibility to use a wide spectrum of innovative technologies to build AI solutions under various predictive analytics and deep learning paradigms, applying all this in a wide variety of industries and business contexts.\nLikewise, thanks to our specialist path you will have the opportunity to grow as a data scientist, having tools and resources for your continuous learning and growth, while getting involved in different challenges that allow both SDG Group and our clients to fully exploit the infinite possibilities offered by artificial intelligence.\nResponsibilities ✍\n- Develop data-driven solutions for tough business challenges across a wide range of business domains by using state-of-the-art data science techniques and understand how to turn theory and models into business operations.\n- Work with stakeholders across the organization to identify opportunities to leverage internal and external data.\n- Ensure the application of the data science solution to drive value and other business outcomes, as well as support cost-saving initiatives.\n- Work collaboratively with different engineering and functional teams to design and implement end-to-end advanced analytics solutions, particularly machine learning and artificial engineering, and monitor results.\n- Lead the development of processes and tools to monitor and analyze the performance and accuracy of AI/ML (MLOps) systems.\n- Stay up to date with the latest technology trends in AI and data science.\n- Expert advice to the business in terms of opportunities, data modeling and data science",
            "location": "Chicago, IL"
        },
        {
            "title": "Principal Data Scientist",
            "company": "Verizon",
            "link": "https://www.linkedin.com/jobs/view/principal-data-scientist-at-verizon-4176423252?position=5&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=SMAYzmSCg274U0xfT6cpGw%3D%3D",
            "posted time": "6 days ago",
            "description": "Making recommendations based on data with excellent visual representations of stories based on data for making critical business decisions.\nExploring research in the data science field and utilizing open source research results for the improvement of customer facing products.\nCollaborating with cross functional teams i.e. engineers, managers, stakeholders and identifying opportunities to improve our products and customer experience.\nDeveloping comprehensive understanding of data and complexity of multiple systems to develop a seamless data pipeline which can visualize data at scale with cent percent accuracy.\nBuilding Machine / Deep Learning models.\nWorking with Teradata, Hive, Spark, Tableau, Postgres, other big data systems with Verizon grid computing infrastructure.\nMentoring and developing the team.\nBachelor’s degree or four or more years of work experience.\nSix or more years of relevant experience required, demonstrated through one or a combination of work and/or military experience, or specialized training.\nExperience as a data scientist or statistical modeler.\nExperience in one or more languages like Java, R, MATLAB, Python - generators, iterators, comprehensions, Numpy, Pandas, Matplotlib, Sklearn, Keras, Tensorflow, Pytorch.\nExperience with Machine Learning, Statistics and Probability, NLP, Deep Learning especially experience in recommendation systems, conversational systems, information retrieval, computer vision, regression modeling.\nExperience with Visualization tools Matplotlib, Seaborn, Tableau, Grafana etc..\nDemonstrated experience writing queries for reporting, analysis and extraction of data from big data systems.\nExperience applying machine learning in a credit or banking use case.\nExtensive experience in Loan Loss Forecasting, including developing PD, LGD, risk rating, and cash flow models.\nExperience automating and productionalizing credit model processes and documentation using Gitlab & Sphinx.\nAbility to engage with larger credit organizations, including presentations, instructional meetings, and code reviews.\nA Master's degree in a quantitative discipline such as Mathematics, Statistics, Financial Economics/Econometrics, Engineering, Computer Science, or Operations Research.\nExperience in visual science / dashboard design principles.\nExperience in applying statistical ideas and methods to data sets to answer business problems.\nExperience with programming languages, like Python, SQL, or R.\nExperience with Machine Learning algorithms and tools.",
            "location": "Rolling Meadows, IL"
        },
        {
            "title": "AI/ML Engineer",
            "company": "Nimblemind.ai",
            "link": "https://www.linkedin.com/jobs/view/ai-ml-engineer-at-nimblemind-ai-4196500934?position=6&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=n6LTlAX%2B8MOxvPgiE2U8bw%3D%3D",
            "posted time": "3 days ago",
            "description": "We are seeking a mission-driven and hands-on AI/ML Engineer to contribute to the development and scaling of our AI-driven solutions for healthcare. This is a key role responsible for building innovative machine learning models, refining data pipelines, and deploying production-ready systems that empower healthcare providers and improve patient outcomes. Reporting directly to the CAIO, the AI/ML Engineer will collaborate closely with our business, engineering, and product teams to ensure that Nimblemind delivers on its transformative promise.\nKey Responsibilities\nHands-On Model Development\nBuild production-ready predictive and statistical models (LLMs, CNNs, SHAP etc.) to address healthcare use cases.\nCurate domain-specific datasets and engineer specialty-specific models.\nDesign ETL frameworks and pipelines for long-term scalability.\nOperational Excellence\nOptimize AI system reliability, performance, and scalability.\nEstablish benchmarks for AI performance and ensure continuous improvement.\nTechnical Leadership\nHelp define and execute the technical vision, architecture, and roadmap for Nimblemind’s AI solutions.\nCollaborate with engineers to integrate machine learning workflows into the platform.\nEnsure technical decisions align with business goals and support long-term scalability.\nManage timelines and resources to meet delivery milestones effectively.\nCustomer-Centric Development\nWork closely with healthcare professionals and technology partners to refine AI solutions.\nBuild high fidelity, high-performance, and scalable systems to meet the unique needs of healthcare providers.\nAdvocate for and implement ethical AI practices, prioritizing patient privacy and data security standards.\nTeam Building and Culture\nPartner with cross-functional teams to ensure the successful deployment of AI systems.\nFoster a collaborative and innovative culture aligned with Nimblemind’s mission.\nActively participate in code reviews, debugging sessions, and versioning.\nPreferred Qualifications\nPhD or MS in Computer Science, Artificial Intelligence, Machine Learning, or a related field.\n5+ years of experience using machine learning to derive healthcare insights from large disparate data sets such as EMR, Claims, or Imaging data.\nExperience with acquisition of open-source and proprietary clinical datasets for model training\nFamiliarity with deep learning/GenAI (MedLM, Llama, and CNNs), tree-based models (Random Forest, GBM, XGBoost), clustering models (K-means, KNN, DBSCAN), and explainability (SHAP, LIME).\nExperience working with temporal, wearable, cross-sectional, and unstructured data.\nDemonstrated success in early-stage environments, with a willingness to get hands on and be an individual direct contributor.\nPassion for transforming healthcare through technology and AI.\nWhy Join Nimblemind.ai?\nBe part of a mission-driven company shaping the future of healthcare.\nLead the development of groundbreaking products while contributing directly to their design & creation.\nCollaborate with a world-class team of healthcare and technology innovators.\nCompetitive compensation package, including equity in a fast-growing startup.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Science and Analytics Analyst",
            "company": "Razorfish",
            "link": "https://www.linkedin.com/jobs/view/data-science-and-analytics-analyst-at-razorfish-4193285369?position=7&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=l0ORApghLezjbI7UvjbvFg%3D%3D",
            "posted time": "3 days ago",
            "description": "Be the data subject matter expert (SME) for internal and external client project work\nUnderstand all facets of the data from its origin and extraction to its interpretation and use\nUnderstand Razorfish’s data capabilities, and how data fits into a client's overall strategy\nUnderstand the breadth of data services and crafts\nAble to manage data team responsibilities within cross-capability projects.\nAble to identify / focus on key issues and objectives based on internal and client needs with oversight\nIs an active listener and seeks to positively contribute to internal discussions\nAble to prepare internal and client presentations with oversight\nTakes accurate and comprehensive meeting notes\nWrites clear and concise summaries of own work\nClient Partnerships\nParticipates actively in meetings with internal and external clients\nAble to prioritize work to meet internal and external client deliverables\nRelationship Management\nCan identify when a request should be completed by the data team\nAble to identify points of contact within internal and external clients\nHas working knowledge of statistical concepts / coding languages (or deep knowledge of statistical concepts that have not yet been applied in a marketing context)\nFamiliar with basic functions of Excel, including pivot tables and lookup formulas\nFamiliar with base case statements for SQL and RegEX\nFamiliarity with BI/Visualization tools\nUnderstands internal and client-specific data tools and platforms for reporting and analyses\nAble to assist in vendor and platform assessments\nProactively identifies own learning gaps and seeks to answer them through internal resources or asking experts\nTranslates data into visuals (charts and graphs) that demonstrate the findings and can contribute to client presentations in PowerPoint\nAble to QA and data integrity at collection, extraction, and activation point\nPlanning and Implementation\nAble to contribute to a learning agenda / measurement plan with guidance\nAble to begin the process / build the basic structure of implementing a measurement program with guidance\nInsight Generation\nAble to extract, cleanse, and analyze data, identify trends and anomalies.\nShows foundation to derive insights from extracted and manipulated data\nDemonstrates foundational ability to synthesize implications (\"so whats?\") from analysis\nUses these insights to provide hypotheses and useful recommendations to the team\nPaid Family Care for parents and caregivers for 12 weeks or more\nMonetary assistance and support for Adoption, Surrogacy and Fertility\nMonetary assistance and support for pet adoption\nEmployee Assistance Programs and Health/Wellness/Comfort reimbursements to help you invest in your future and work/life balance\nTuition Assistance\nPaid time off that includes Flexible Time off Vacation, Annual Sick Days, Volunteer Days, Holiday and Identity days, and more\nMatching Gifts programs\nFlexible working arrangements\n‘Work Your World’ Program encouraging employees to work from anywhere Publicis Groupe has an office for up to 6 weeks a year (based upon eligibility)\nBusiness Resource Groups that support multiple affinities and alliances",
            "location": "Chicago, IL"
        },
        {
            "title": "Decision Scientist",
            "company": "CVS Health",
            "link": "https://www.linkedin.com/jobs/view/decision-scientist-at-cvs-health-4197418442?position=8&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=bZyvU7wr4XYKXhORO642FQ%3D%3D",
            "posted time": "4 days ago",
            "description": "Identify, analyze, and interpret trends or patterns in complex data sets\nPrepares and disseminates analysis reports, and presentations to various audiences both internal and external\nCollaborates with internal program staff around all evaluation and analysis activities\nHandles all data requests and special analyses for internal and external partners\nAssists in developing actionable metrics to quantify the impact of programming\nEstablishes relationships with internal and external partners to obtain and validate quality data\nAssists in creating uniform business rules that will be used in all ad-hoc analyses\nOther duties as assigned.\nUndergraduate degree, preferably in Computer Science, Business or Analytics\n2 or more years of relevant work experience\nProficient in writing SQL queries and stored procedures on large data sets with complex data models\nAdvanced Microsoft Excel skills (PowerPivot, functions, VBA)\nData management experience; knowledgeable in database rules, writing queries, and relational database creation and management (create, query, relate)\nAn analytical mind and inclination for problem-solving\nAbility to manage deadlines and deliverables and communicate them to business owners\nAbility to communicate clearly to stakeholders\nBusiness process understanding\nUS work authorization\nSomeone who embodies being \"Oaky\"\nRadiating positive energy\nAssuming good intentions\nCreating an unmatched patient experience\nDriving clinical excellence\nTaking ownership and delivering results\nBeing relentlessly determined\nMission-focused career impacting change and measurably improving health outcomes for medicare patients\nPaid vacation, sick time, and investment/retirement 401K match options\nHealth insurance, vision, and dental benefits\nOpportunities for leadership development and continuing education stipends\nNew centers and flexible work environments\nOpportunities for high levels of responsibility and rapid advancement\nAffordable medical plan options, a 401(k) plan (including matching company contributions), and an employee stock purchase plan.\nNo-cost programs for all colleagues including wellness screenings, tobacco cessation and weight management programs, confidential counseling and financial coaching.\nBenefit solutions that address the different needs and preferences of our colleagues including paid time off, flexible work schedules, family leave, dependent care resources, colleague assistance programs, tuition assistance, retiree medical access and many other benefits depending on eligibility.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data Science Associate",
            "company": "Valor Equity Partners",
            "link": "https://www.linkedin.com/jobs/view/data-science-associate-at-valor-equity-partners-4198339955?position=9&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=CkIOKmBLd%2F9ZUKm7stv%2FOw%3D%3D",
            "posted time": "1 day ago",
            "description": "About Valor:\nValor Equity Partners is a different kind of private investment firm. We pioneered the idea of operational growth. We work side-by-side, shoulder-to-shoulder, to help grow the operations of great companies solving the world’s biggest problems. We invest in technology and technology-enabled companies that innovate and disrupt existing industries — from biosciences to transportation to food to health and wellness. We’ve had the honor of serving some of the world’s greatest entrepreneurs and companies, including Tesla, SpaceX, Anduril, Eight Sleep, GoPuff, and others.\nOur values are core to all we do. These values are excellence, humility, integrity, and responsibility.\nValor means that we:\nStrive for excellence in everything we do;\nMaintain our humility and mutual respect no matter what circumstances we encounter;\nInsist upon the highest level of integrity in our interactions and in the logic of our investment process; and\nDemonstrate responsibility and dedication to all of our constituents.\nAbout our Team:\nOn the Valor Labs Team, we develop cutting edge machine learning models to derive proprietary investment insights and build software applications to augment the Firm’s investment decision making process. As a small team of software engineers and data scientists with diverse backgrounds, we work collaboratively on wide-ranging problems to deliver high-impact products for the Firm.\nAbout the Role:\nAs a Data Scientist on our team, you will contribute directly to the development of high-impact products. Working together with other data scientists, engineers, and stakeholders, you will translate complex project requirements into actionable technical solutions and work collaboratively to build, deploy, monitor, and maintain those solutions in production. Your technical expertise and commitment to excellence will help drive the adoption of best practices and ensure the highest level of rigor in everything we do.\nAbout You:\nB.S. and/or M.S. in Computer Science, Mathematics, Statistics, or related field\n2+ years of relevant work experience, not including internships\nStrong foundational knowledge in machine learning, statistics, and probability\nProficient with Python and SQL\nHumble, hard-working, and collaborative\nThe following are not necessary but nice to have:\nSpecific experience with time-series modeling, graph-based modeling, and/or natural language processing (incl. LLMs)\nExperience with modern cloud infrastructure (e.g., AWS), containerization (e.g., Docker), and/or orchestration tools (e.g., Airflow)\nNote: This role is required to be in office three days a week",
            "location": "Chicago, IL"
        },
        {
            "title": "AI/ML Engineer",
            "company": "Jobot",
            "link": "https://www.linkedin.com/jobs/view/ai-ml-engineer-at-jobot-4198567455?position=10&pageNum=2&refId=Gp7rmo8J8gnnmvOFqIMVJA%3D%3D&trackingId=WustY%2BGMGcgzkf%2FFlj6R2A%3D%3D",
            "posted time": "1 day ago",
            "description": "Medical\nDental\nVision\n401k\nAbility to work on cutting edge AI/ML Solutions\nMaster's degree in Machine Learning, Data Science, AI, Computer Science, Computer Engineering, Electrical Engineering, or a closely related field\nExperience in running ML/AI models in distributed clusters, GPU optimization, and parallel environments\nExperience in data science or ML engineering role\nExperience in projects or building products that materially use and deploy language models or generative AI\nExperience in product development in ML or AI\nExperience in designing, developing and deploying conversational AI solutions\nExperience in GCP and Snowflake\nExperience in financial services\nProficiency in Python or R, vector databases, PyTorch/Tensorflow/JAX, industry-standard NLP toolkits and AI platforms",
            "location": "Chicago, IL"
        },
        {
            "title": "Intern, Data Science",
            "company": "Annalect",
            "link": "https://www.linkedin.com/jobs/view/intern-data-science-at-annalect-4192702067?position=1&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=6ugMye%2FYh6B18qkzyvVwjg%3D%3D",
            "posted time": "1 week ago",
            "description": "Perform exploratory data analysis and data queries, against outlined objectives, to ensure the availability of the right data and required sample sizes\nRun predictive modeling utilities to define and project (score) audiences for deployment\nEvaluate model performance/model separation to determine cut-off points and output resulting user pools for deployment (in/out phase gains charts)\nPartner with data science team to develop new methodologies and utilities\nRelevant coursework in analytics, statistics, mathematics, economics, engineering, information management, social sciences or business/marketing related fields.\nHands-on experience with SQL, R, and Python\nFamiliarity with supervised and unsupervised machine learning preferred\nWork done during this internship will have high visibility and will be used on client projects\nExposure to Industry leading data sets and platforms\nExposure working with production codebases in Python and other platforms\nEnhance knowledge of the media industry and marketing data analytics\nMentorship from leading, marketing intelligence managers and successful professionals\nOpportunity to participate in Company networking events, lunch & learns, cultural events and internship program activities\nPaid Internship\nFlexible schedule for students",
            "location": "Chicago, IL"
        },
        {
            "title": "AI Engineer",
            "company": "Thermo Fisher Scientific",
            "link": "https://www.linkedin.com/jobs/view/ai-engineer-at-thermo-fisher-scientific-4196252806?position=2&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=a602o1%2Ffj6osg8aRaUbISw%3D%3D",
            "posted time": "3 days ago",
            "description": "Build AI Solutions: Develop predictive models, anomaly detection systems, and LLMs to optimize QMS performance.\nImprove GenAI and LLMs: Apply Generative AI techniques and LLMs to automate and improve tasks like quality events analysis, document reviews, and complaint management.\nWork with various teams like Quality, IT, and Technical Ops to integrate solutions into QMS.\nCollaborate with Data Scientists and Data Engineers to prepare and analyze large datasets, identifying trends and areas for process improvement.\nAutomating Routine Tasks: Using AI technology to automate routine quality management processes, decreasing manual workload and growing operational efficiency.\nEnsure Regulatory Alignment: Ensure that AI models, particularly LLMs and GenAI solutions, align with industry regulations, quality standards, and ethical guidelines, particularly in GxP and FDA-regulated environments.\nValidate and supervise models like GenAI and LLMs to .\nKeep up with AI/ML Advancements: Stay updated on new AI/ML technologies and their applications for QMS innovation.\nEducation: Bachelor’s or equivalent experience in Data Science, Computer Science, or a related field.\nExperience in developing machine learning and AI models, including techniques such as classification, regression, anomaly detection, reinforcement learning, and sophisticated Generative AI (e.g., text generation, summarization, LLMs).\nProgramming Proficiency: Strong proficiency in Python or R, with hands-on experience in developing Generative AI applications and deploying Large Language Models (e.g., GPT-3/4, BERT, T5).\nAI/ML Frameworks and Libraries: Familiarity with leading AI/ML frameworks such as TensorFlow, PyTorch, Hugging Face Transformers, scikit-learn, and Keras.\nExperience with GenAI and LLMs: Strong understanding of Generative AI and Large Language Models for tasks such as document generation, summarization, classification, and process automation.\nRegulatory Knowledge: Experience working in regulated industries, such as life sciences or medical devices, is a plus. Knowledge of GxP and FDA regulations is helpful.\nCloud Platforms: Strong understanding of cloud computing platforms (e.g., AWS, Azure, Google Cloud) for deploying AI solutions at scale.\nProblem-Solving and Communication: Demonstrating excellent problem-solving skills, effective communication abilities, and the capability to explain intricate AI concepts to non-technical collaborators.\nPartnership and Adaptability: Ability to work optimally in collaborative, multi-functional teams and adapt to evolving business requirements.\nExperience with AI ethics and responsible deployment of Generative AI models, especially in regulated environments.\nKnowledge of NLP (Natural Language Processing) techniques for document classification, summarization, and automation.\nFamiliarity with model interpretability and explainable AI methods.\nExperience with DevOps practices, including CI/CD pipelines for model deployment.\nA choice of national medical and dental plans, and a national vision plan, including health incentive programs\nEmployee assistance and family support programs, including commuter benefits and tuition reimbursement\nAt least 120 hours paid time off (PTO), 10 paid holidays annually, paid parental leave (3 weeks for bonding and 8 weeks for caregiver leave), accident and life insurance, and short- and long-term disability in accordance with company policy\nRetirement and savings programs, such as our competitive 401(k) U.S. retirement savings plan\nEmployees’ Stock Purchase Plan (ESPP) offers eligible colleagues the opportunity to purchase company stock at a discount",
            "location": "Chicago, IL"
        },
        {
            "title": "Sr. Data Scientist",
            "company": "The Scion Group",
            "link": "https://www.linkedin.com/jobs/view/sr-data-scientist-at-the-scion-group-4174512179?position=3&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=DriL6X49XelJFug0JV1dIw%3D%3D",
            "posted time": "1 week ago",
            "description": "Lead the development, deployment, and monitoring of machine learning models in production environments, ensuring scalability, stability, and performance.\nDesign and implement predictive models and algorithms, ensuring they align with business objectives and generate actionable insights.\nProvide guidance and mentorship to junior data scientists, fostering a culture of continuous learning and best practices in ML Ops and model deployment.\nPartner with the Product Engineering team to integrate models and predictions into our proprietary business intelligence platform. Work closely with the Revenue Management team to implement insights that optimize business decisions.\nMaster’s or PhD in Data Science, Statistics, Computer Science, or related field.\n5+ years of experience in data science.\nStrong expertise in machine learning, statistical analysis, and programming languages like Python or R.\nExperience with big data technologies and tools such as Snowflake, Amazon, Databricks, Tableau, Power BI, Looker, and other similar tools.\nJob location is based at Scion headquarters in Chicago, IL\nWorking hours are general daytime business hours.\nHealth Insurance\nDental Insurance\nVision Insurance\n401k Matching\nPaid Maternity Leave\nFLSA Status\nDiscretionary annual EOY bonus\nPaid Time Off",
            "location": "Chicago, IL"
        },
        {
            "title": "Manager, Data Science",
            "company": "Ahold Delhaize USA",
            "link": "https://www.linkedin.com/jobs/view/manager-data-science-at-ahold-delhaize-usa-4194704586?position=4&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=mAiYhW%2BNLNHn2mt8ix5t4Q%3D%3D",
            "posted time": "1 week ago",
            "description": "Provide ongoing leadership to a strong, capable team that meets or exceeds the company’s Data Science requirements\nDevelop and train team of Data Scientists to create quality models, ensuring outputs are logical and actionable\nProvide ongoing counsel to Brand strategy, Marketing and Merchandising Leadership and other key decision makers regarding proper interpretation and application of model output\nProvide input and significantly influence the development and refinement of company strategies\nLead the development and deployment of customer segmentations, scores, store clustering and other KPI models to predict the impact of potential actions or programs being considered\nLead innovation in data science methodologies and tools, staying abreast of industry developments and proactively exploring opportunities to advance organizational capabilities\nDevelop strong relationships that enable learning about the business and how their work directly impacts decisions. For specific projects, draw out critical information that impacts the learning objectives and incorporate into all work\nIdentification of additional data requirements and partner with the data domain owners to collect and organize new data elements\nMaintain proficiency with major business systems and the data on which it relies\nSubject matter expert on methodologies and data sources used in modeling environment.\nAbility to analyze data via statistical and machine learning concepts, and present recommendations based on that data\nPartner closely with other team members within Data Science to ensure appropriate integration of data\nProgramming Languages – SQL, Python, Spark\nStrong foundation in statistics and machine learning\nFamiliarity with Software Development Lifecycle and Agile project management\nMaster’s Degree in Quantitative Field (Statistics, Mathematics, Economics, etc)\n6+ years experience in Data Science\n2+ years managing an Analytics team\nDatabricks\nProficient in Power Bi & Tableau\nFamiliarity with Software Development Lifecycle and Agile project management\n3+ years experience with deploying production level models, preferably time-series models",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Machine Learning Engineer",
            "company": "Evolve Group",
            "link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-at-evolve-group-4197546590?position=5&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=rQwlT8kE7MMn5EGvRqoVdg%3D%3D",
            "posted time": "2 days ago",
            "description": "Who wouldn’t want to apply cutting-edge ML and AI techniques to disrupt the finance industry?\nIf you excel in an environment that values technical innovation, high-impact AI solutions, and fast execution, this is the place for you. You'll work with LLMs, retrieval-augmented generation (RAG), reinforcement learning, and generative AI to develop scalable, real-time trading models that power both high-frequency and mid-frequency strategies across global markets.\nWith expertise in transformers, diffusion models, NLP, computer vision, and deep reinforcement learning, you’ll play a critical role in designing and optimizing AI-driven trading platforms that process massive financial datasets. Your work will directly influence automated decision-making, predictive modeling, and strategy optimization in one of the most sophisticated and profitable trading operations in the world.\nIf you thrive in high-stakes environments and want to collaborate with top-tier AI researchers and engineers, you’ll find this opportunity to be truly rewarding.\nYou don’t need industry experience (though it’s a major advantage), but you’ll benefit from:\nA quantitative discipline of study; Computer Science, AI, or a related STEM field\nExperience applying LLMs, RAG, deep reinforcement learning, and generative AI to real-world challenges\nA high-performance mentality – a proven track record of excelling in competitive environments",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Machine Learning Engineer, Full-time, Days",
            "company": "Northwestern Memorial Hospital",
            "link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-full-time-days-at-northwestern-memorial-hospital-4197598383?position=6&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=LEJeBTrH99PcfUjkO7GBQA%3D%3D",
            "posted time": "1 day ago",
            "description": "Enabling digital solutions by leveraging capabilities such as AI, automation, and rollout of advanced cyber controls that support digital transformation strategies\nImplementing advanced technologies in clinical and administrative areas\nFurther develop end user support model to help enhance modern infrastructure\nThis role is dedicated to the Canning Thoracic Institute.\nAs a leader of the Machine Learning Engineering team, you will work with technical and nontechnical stakeholders to design, build, and manage the infrastructure, platforms, and tools that power advanced technology solutions to enhance medical training, improve quality of care, and enable timely interventions for pulmonary and thoracic patients.\nMaster’s degree or equivalent experience in Computer Science, Engineering, Mathematics, or a related field\nAt least 5 years of experience developing, scaling, or deploying machine learning models\nProfessional experience with AWS, Azure, or GCP\nAbility to drive software engineering best practices and share learnings about theoretical and technical developments in ML engineering with team members\nExperience providing technical expertise in the design and development of end-to-end technical solutions\nDemonstrable experience leading the development of reusable common frameworks, models, or components that can be leveraged to solve common ML problems\nBasic understanding of computer architecture and how it affects software performance\nDemonstrable experience with version control in a team environment\nProficiency in SQL, Python, and a deep learning framework (e.g. TensorFlow, PyTorch)\nDemonstrable professional experience with CI/CD and RESTful APIs\nBasic understanding of MLOps and associated tools (e.g. MLflow)\nHands-on experience with containerization (Docker preferred)\nA commitment to writing readable, tested, and well-documented code\nDeep understanding of fundamental computer science concepts, including data structures, algorithms, automated testing, and object-oriented programming\nDemonstrable experience working independently and managing multiple priorities\nComfortable communicating clearly and succinctly with audiences of varying technical backgrounds\nMotivated by a curiosity for understanding how complex systems work\nAbility to teach and mentor others\nPhD in Computer Science, Engineering, Mathematics, or a related field\nHealth care data integration experience (PHI/HIPAA, HL7 FHIR)\nFamiliarity with FDA regulation for software as a medical device\nProduction experience with Databricks, Spark, and/or Kubernetes\nKnowledge of audio processing workflows and models\nKnowledge of computer vision workflows and models\nFamiliarity with asynchronous programming patterns\nFamiliarity with GitHub or Azure DevOps\nHands-on experience with Terraform\nExperience with C, C++, C#, or Go\nHealthcare experience\nEpic experience",
            "location": "Chicago, IL"
        },
        {
            "title": "Associate Scientist",
            "company": "Planet Pharma",
            "link": "https://www.linkedin.com/jobs/view/associate-scientist-at-planet-pharma-4198388008?position=7&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=h3gJ9Z%2FPu1xzIQRVOp5FwQ%3D%3D",
            "posted time": "1 day ago",
            "description": "-3 month contract\n-Pay: 27-30/hr\nShift: 5:45 AM – 6:15 PM Rotating schedule 2 days on 2 days off every other weekend (OT on a need basis)\nPOSITION SUMMARY\nResponsible for collection and testing of routine environmental monitoring samples within aseptic processing fill lines, Isolator fill line, compounding, sterility suite, and component preparation areas for aseptic lines (Building A) and clean rooms areas in new expansion Building B. Collect and test utility samples such as WFI, clean steam and compressed gases. Monitors environmental conditions in laboratory areas during test sessions. Reports testing results and documents in compliance with cGMP and GLP standards. Provides support to Scientist, Lead Scientist, and Supervisor. Prepares media, reagents, sanitizing solutions and equipment for use in testing.\nPRINCIPAL ACTIVITIES:\n• Perform environmental monitoring in controlled areas for non-viable airborne particulate, viable airborne bioburden, viable surface bioburden, settle plate bioburden and personnel monitoring.\nMaintain gowning certification and apply good aseptic technique and clean room behavior.\nCollect and process samples for water for Injection (WFI), clean steam and compressed gases according to established standard operating procedures.\nPerform bioburden, endotoxin, Total Organic Carbon (TOC), and conductivity testing for utility samples.\nPerform sub-culturing and Gram-staining of microorganisms.\nPerform growth promotion on incoming media to release for monitoring use in the facility.\nMaintain and review temperature records, lab cleaning records, and logbooks.\nInput results in Laboratory Information Management System (LIMS) database and track microbiological results. Must be able to understand and follow company's good documentation practices.\nCompile and submit environmental monitoring data for critical system release.\nSupports Scientist/ Lead Scientist/ Supervisor with testing and special projects. Carries out special projects independently as required and assigned by supervision.\nAids with plant and laboratory equipment re-qualifications as directed.\nPromptly reports data discrepancies and out of limit conditions to supervision. Carries out documentation, and assist Scientist and Lead Scientist with investigation, incident reports and corrective actions as assigned.\nREQUIREMENTS\nBS/BA degree in Science or related field.\nOR\nAS/AA degree with 1-3 years of relevant laboratory experience or progressive pharmaceutical lab experience\nOR\nSome college with 5 or more years of relevant laboratory experience or progressive pharmaceutical lab experience. Applicable industries include but are not limited to testing laboratories, food, cosmetic, veterinary, or hospital laboratories.\nStrong verbal and written communication skills are essential. Attention to detail, people skills and ability to multi-task are essential for success.",
            "location": "Melrose Park, IL"
        },
        {
            "title": "AI- Machine Learning Ops Engineer",
            "company": "Ahold Delhaize USA",
            "link": "https://www.linkedin.com/jobs/view/ai-machine-learning-ops-engineer-at-ahold-delhaize-usa-4194708052?position=8&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=DnC8UDupVFrTrGLHs5KefA%3D%3D",
            "posted time": "1 week ago",
            "description": "Design and deploy scalable infrastructure for ML workloads using cloud platforms and containerization technologies (e.g., Docker, Kubernetes)\nWork with teams to design and build cloud hosted, automated pipelines that run, monitor, and retrain ML Models for business applications\nDesign and implement Model and Pipeline validation procedures alongside teams of Data Scientists, Data Engineers, and other ML Engineers\nOptimize and refactor development code so that it can be moved to production\nBuild Data, Feature Engineering Pipelines for new and existing models\nAssemble configurations and specifications to automatically build environments in production\nCreate and develop in CI/CD Pipelines which allow for controlled and continuous enhancement of existing work and new features during both development and production phases\nDemo new projects and features to stakeholders and excited team members\nAn enthusiasm to ask questions of team members and learn new things is essential, as nobody can be expected to know everything. We pride ourselves in being one of the most supportive teams in the business, and we all build off one another to achieve great things\nMasters Degree in Computer Science or Technical field; equivalent trainings/certifications/experience equivalency will be considered\n5 or more years of equivalent experience in relevant job or field of technology.\nExperience in an advanced role or technical capacity, leading teams directly or indirectly\nExperience in mentoring, training or onboarding team members in relevant technologies, capabilities or skills\nProficiency in programming languages such as Python, Java, and/or C#\nStrong understanding of machine learning principles and model lifecycle management\nPost graduate degree advanced training and or certifications in relevant field/s of study preferred\n3 or more years experience in Agile teams and or Product/Platform based operating model.\nExperience with machine learning models and cloud infrastructure\nExperience in leading teams.",
            "location": "Chicago, IL"
        },
        {
            "title": "Machine Learning Engineer",
            "company": "IMC Trading",
            "link": "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-imc-trading-4176794568?position=9&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=r0ONY%2Bb1kIxs%2F05X%2BI%2BFEQ%3D%3D",
            "posted time": "23 hours ago",
            "description": "As a Machine Learning Engineer, you will play a pivotal role in building systems that drive the training and deployment of large-scale ML models across our global operations. You'll collaborate with leading researchers, hardware experts, and software engineers to build robust solutions that maximize the potential of GPU acceleration, distributed computing, and the latest open-source tools. Your work will influence our trading strategies by accelerating experimentation cycles that foster continuous innovation and refinement.\nThis is a unique opportunity to solve problems at the intersection of advanced machine learning and trading, where your contributions will shape the future of IMC’s technology and trading capabilities.\nYour Core Responsibilities:\nDevelop large-scale distributed training pipelines to manage datasets and complex models\nBuild and optimize low-latency inference pipelines, ensuring models deliver real-time predictions in production systems\nDevelop libraries to improve the performance of machine learning frameworks\nMaximize performance in training and inference using GPU hardware and acceleration libraries\nDesign scalable model frameworks capable of handling high-volume trading data and delivering real-time, high-accuracy predictions\nCollaborate with quantitative researchers to automate ML experiments, hyperparameter tuning, and model retraining\nPartner with HPC specialists to optimize workflows, improve training speed, and reduce costs\nEvaluate and roll out third-party tools to enhance model development, training, and inference capabilities\nDig into the internals of open-source ML tools to extend their capabilities and improve performance\nYour Skills and Experience:\n5+ years of experience in machine learning with a focus on training or inference systems\nHands-on experience with real-time, low-latency ML pipelines in high-performance environments is a strong plus\nStrong engineering skills, including Python, CUDA, or C++\nKnowledge of machine learning frameworks such as PyTorch, TensorFlow, or JAX\nProficiency in GPU programming for training and inference acceleration (e.g., CuDNN, TensorRT)\nExperience with distributed training for scaling ML workloads (e.g., Horovod, NCCL)\nExposure to cloud platforms and orchestration tools\nA track record of contributing to open-source projects in machine learning, data science, or distributed systems is a plus",
            "location": "Chicago, IL"
        },
        {
            "title": "PhD, Data Scientist Intern",
            "company": "Stripe",
            "link": "https://www.linkedin.com/jobs/view/phd-data-scientist-intern-at-stripe-4151697990?position=10&pageNum=3&refId=WW0Q24ft9lS7voU9F8ab3A%3D%3D&trackingId=XsCS03vHjkTCpkRhv9Hs5A%3D%3D",
            "posted time": "6 days ago",
            "description": "Partner closely with Data Scientists, Data Analysts, and business partners to drive business impact through rigorous analytical solutions\nApply machine learning, causal inference, or advanced analytics on large datasets to: i) measure results and outcomes, ii) identify causal impact and attribution, iii) predict the future performance of users or products, to drive business success\nInfluence business actions and strategy by developing actionable insights through metrics and dashboards.\nDrive the collection of new data and the refinement of existing data sources.\nLearn quickly by asking great questions, finding how to work with your mentor and teammates effectively, and communicating the status of your work clearly\nPresent your work to the Data Science team, partner teams, and fellow interns\nEnrolled in a quantitative PhD program (e.g. Mathematics, Science, Engineering, Economics, Statistics, or Computer Science) with the expectation of graduating in winter 2025 or spring/summer 2026\nExperience with a scientific computing language (such as Python, R, etc) and SQL. We believe new programming languages can be learned if the fundamentals and general knowledge are present!\nKnowledge and hands-on experience in several of the following areas: machine learning, statistics, optimization, product analytics, causal inference, and/or experimentation\nExperience communicating and collaborating with multidisciplinary stakeholders in a team environment\nExperience writing and debugging data pipelines\nDemonstrated ability to evaluate and receive feedback from mentors, peers, and stakeholders via experience from previous internships or other multi-person projects\nAbility to learn new systems and form an understanding of those systems, through independent research and working with a mentor and subject matter experts\nThis role is not eligible for hire in the Greater Seattle Area, San Francisco Bay Area, or New York City. We are hiring these positions in Chicago, IL or Toronto, Ontario, Canada.",
            "location": "Chicago, IL"
        },
        {
            "title": "Staff ML Scientist, AI Research & Development",
            "company": "Tempus AI",
            "link": "https://www.linkedin.com/jobs/view/staff-ml-scientist-ai-research-development-at-tempus-ai-4199931480?position=1&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=Wbqmn%2BCwZuM59SvxkAjJoA%3D%3D",
            "posted time": "1 day ago",
            "description": "Responsible for developing innovative and practical Large Multimodal models and Generative AI models/applications for Tempus product line that solve impactful business challenges at Tempus across all our business units - touching on clinical notes, electronic health records, medical imaging, sequencing data, etc.\nCollaborate cross-functionally with other teams to understand needs and requirements, ensuring the Model/algorithms aligns with strategic company objectives; bring Large Language Models to demonstrable business impact across all of Tempus’ business areas.\nData Expertise: Tempus has one of the largest multimodal patient datasets ever collected, providing a unique opportunity to work with extensive and diverse data. Become an expert in Tempus’ vast epidemiological, clinical, genetic, transcriptomic and imaging data, along with the latest tools and techniques for their analysis and modeling.\nInnovation: build an LLM driven platform leveraging Tempus’ vast real world database to discover predictive opportunities guiding optimal therapy, fusing features from multiple data modalities, and predictive model prototypes for established oncology therapies.\nLeadership: mentor, strategically lead, and manage delivery from a cross-functional project team.\nTeamwork and collaboration: Work with Data Science, Research, Engineering and Product teams across Tempus’ expansive data science community.\nClinical and Drug R&D Expertise: Learn from leading professionals in the medical and pharmaceutical industries to gain proficiency in their strategies, drug modalities, and pipelines to identify where the Tempus platform can add value.\nScientific Communication: Skillfully communicate complex technical results and methodologies to diverse internal and external stakeholders; published in peer reviewed journals.\nPersonal development: Continuously immerse yourself in the latest advances in AI in the biomedical setting, to revolutionize clinical care and drug R&D.\nDeep understanding of machine learning concepts, including large language models (LLMs), transformer architectures, embedding representations, and multimodal fusion techniques.\nExtensive experience working with large-scale, real-world datasets, particularly in complex domains like healthcare.\nProficient in Python and SQL, along with core machine learning libraries and frameworks (e.g., PyTorch, TensorFlow, scikit-learn).\nHands-on experience with large model training and orchestration frameworks, including NVIDIA NeMo, Hugging Face Transformers, Weights & Biases, and MLflow.\nFamiliarity with distributed training, model optimization, and GPU/TPU-based acceleration is a strong plus.\nExcellent written and verbal communication skills, with the ability to clearly explain complex technical concepts to both technical and non-technical audiences.\nExperience bringing in thought leadership to the product and team. Bias-to-action, appetite for high-risk high-gain projects with a pragmatic approach to rapid and measurable progress.\nThrive in a fast-paced environment and willing to shift priorities seamlessly.\nGoal orientation, self-motivation, and drive to make a positive impact in healthcare.\nPrevious experience working with real-world data (e.g. from electronic health records), transcriptomic or genetic (NGS) data sets. Experience working with sensitive healthcare data, medical imaging modalities, clinical workflows, and healthcare terminology. Familiarity with electronic health records (EHRs) , and medical imaging formats (e.g., DICOM), molecular data is advantageous.\nStrong peer-reviewed publication record.",
            "location": "Chicago, IL"
        },
        {
            "title": "Applied Scientist, Prime Tech, Prime Science - ML",
            "company": "Amazon",
            "link": "https://www.linkedin.com/jobs/view/applied-scientist-prime-tech-prime-science-ml-at-amazon-4049882382?position=2&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=3mB8NDkbYBzygD%2FAnlYEDQ%3D%3D",
            "posted time": "3 days ago",
            "description": "Build and develop machine learning models and supporting infrastructure at TB scale, in coordination with software engineering teams.\nLeverage Bandits, Supervised Learning, and Reinforcement Learning for Contextual Recommendation and Optimization Systems.\nDevelop offline policy estimation tools and integrate with reporting systems.\nEstablish scalable, efficient, automated processes for large scale data analyses, model development, model validation and model implementation.\nAnalyze and extract relevant information from large amounts of Amazon’s historical business data to help automate and optimize key processes.\nWork closely with the business to understand their problem space, identify the opportunities and formulate the problems.\nUse machine learning, data mining, statistical techniques and others to create actionable, meaningful, and scalable solutions for the business problems.\nDesign, develop and evaluate highly innovative models and statistical approaches to understand and predict customer behavior and to solve business problems.\nExperience programming in Java, C++, Python or related language\nPhD in computer science, mathematics, statistics, machine learning or equivalent quantitative field\nExperience applying theoretical models in an applied environment\nExperience implementing algorithms using both toolkits and self-developed code\nHave publications at top-tier peer-reviewed conferences or journals\nExperience in state-of-the-art deep learning models architecture design and deep learning training and optimization and model pruning",
            "location": "Chicago, IL"
        },
        {
            "title": "Principal Data Scientist, Science",
            "company": "Chan Zuckerberg Initiative",
            "link": "https://www.linkedin.com/jobs/view/principal-data-scientist-science-at-chan-zuckerberg-initiative-4201044463?position=3&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=HW8doOn8twFW8w0hJtRzTQ%3D%3D",
            "posted time": "3 hours ago",
            "description": "Building an AI-based virtual cell model to predict and understand cellular behavior\nDeveloping state-of-the-art imaging systems to observe living cells in action\nInstrumenting tissues to better understand inflammation, a key driver of many diseases\nEngineering and harnessing the immune system for early detection, prevention, and treatment of disease\nManage a team of data scientists to create high quality, standardized datasets for biological AI modeling and open-source publishing.\nEstablish systems and processes to ensure agility and responsiveness to emerging needs from the rapidly evolving AI biology space.\nDefine a data vision for the Virtual Cell Model, build buy-in with cross-functional partners, and partner to see it incrementally realized as we iterate towards our vision.\nDiscover and define new data generation opportunities, and manage the delivery of those data products to our AI team.\nCollaborate with ML engineers, AI Researchers, and Data Engineers to deliver datasets to train state of the art generative AI models.\nCollaborate with engineers, product managers, UX designers, and other data scientists to publish valuable datasets to accelerate community modeling progress.\n10+ years of experience with biological data, including experience with both imaging and sequencing data modalities.\nHave delivered multiple large data products, at least one of which contains a significant component of sequencing and imaging data.\n5+ years managing teams, including management of hybrid/remote teams.\nExperience with big data: extraction, transport, loading, databases, standardization, and data validation.\nStrong fundamentals in statistical reasoning and machine learning.\nExperience with image and sequence data analysis and QC best practices\nExperience with processing and orchestration pipelines, such as Argo Workflows, Databricks\nExcellent written and verbal communication skills.\nEnthusiasm to ramp up on technologies and learn new domains.\nExperience working in a multidisciplinary environment (engineering, product, design).\nCZI provides a generous employer match on employee 401(k) contributions to support planning for the future.\nAnnual benefit for employees that can be used most meaningfully for them and their families, such as housing, student loan repayment, childcare, commuter costs, or other life needs.\nCZI Life of Service Gifts are awarded to employees to “live the mission” and support the causes closest to them.\nPaid time off to volunteer at an organization of your choice.\nFunding for select family-forming benefits.\nRelocation support for employees who need assistance moving to the Bay Area\nAnd more!",
            "location": "Chicago, IL"
        },
        {
            "title": "Machine Learning Engineer",
            "company": "Jobot",
            "link": "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-jobot-4197580634?position=4&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=XXCtZfzNwKSqh%2FvRKasq6g%3D%3D",
            "posted time": "2 days ago",
            "description": "Medical, Dental, Vision\nEquity\nRemote Flexibility\n401k\nDesign, develop, and implement machine learning algorithms and models to improve manufacturing processes, quality, and efficiency.\nCollaborate with cross-functional teams to understand their business needs and develop end-to-end machine learning solutions.\nConduct research and experiments on machine learning, deep learning, and artificial intelligence, and stay updated with the latest advancements in these fields.\nUtilize your expertise in Python, EHR, medical coding, medical billing, insurance reimbursement, and patient billing to optimize our internal processes and systems.\nDevelop predictive models and machine learning algorithms to identify trends, patterns, and anomalies in manufacturing data.\nWork closely with data scientists and engineers to implement machine learning models into production.\nEvaluate the effectiveness of machine learning models and make necessary adjustments for optimal performance.\nProvide technical leadership and guidance to junior team members.\nBachelor's degree in Computer Science, Engineering, or a related field. A Master's degree or PhD is preferred.\nMinimum of 5 years of experience in machine learning, ML, Python, EHR, medical coding, medical billing, insurance reimbursement, and patient billing.\nProven experience in designing and implementing machine learning models and algorithms.\nStrong programming skills in Python and familiarity with machine learning libraries and frameworks.\nKnowledge of EHR systems, medical coding, medical billing, insurance reimbursement, and patient billing.\nExcellent problem-solving skills and the ability to think critically and creatively.\nStrong communication skills, with the ability to explain complex concepts to non-technical stakeholders.\nAbility to work in a fast-paced, dynamic environment and manage multiple projects simultaneously.\nPassion for continuous learning and staying updated with the latest advancements in machine learning and artificial intelligence.",
            "location": "Chicago, IL"
        },
        {
            "title": "Data scientist- Fixed income - Chicago IL",
            "company": "W3Global",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-fixed-income-chicago-il-at-w3global-4106945202?position=5&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=Q%2BhazX0F6dMqF%2F8Bsu9UNw%3D%3D",
            "posted time": "3 days ago",
            "description": "Apply, develop and deliver advanced machine learning solutions solving the real business problems\nDevelop, maintain and leverage model training and inference pipelines using enterprise level tools and platforms with high code quality\nConnect/translate data science solutions with/into business outcomes and communicate with senior stakeholders\nStrong background in statistics, probability theory, and mathematical modeling is required",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Data Scientist",
            "company": "Moen",
            "link": "https://www.linkedin.com/jobs/view/senior-data-scientist-at-moen-4193928841?position=6&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=CAPDhzu6Ra8aEkhwYC9pjw%3D%3D",
            "posted time": "1 week ago",
            "description": "Lead and drive the development and implementation of AI/ML models and algorithms to drive innovation across the AI within our water products\nCreate the technical strategic vision for data science within water products\nCollaborate with business stakeholders and cross-functional teams across the organization to identify and prioritize high-impact use cases for AI/ML applications\nDrive rapid prototyping efforts, focusing on learning from experiments, iterating on solutions\nDemonstrate innovative and creative thinking to develop novel AI/ML approaches and solutions\nPartner with product teams in order to embed AI/ML model solutions into physical and digital products\nConduct in-depth data analysis and feature engineering to extract valuable insights and improve model performance\nIdentify key insights from large data sources; interpret and communicate insights from data and analysis to product, service, and business managers\nPartner with our ML engineering team to design, develop, and deploy scalable and robust AI/ML solutions to solve complex business problems and improve operational efficiency\nContinuously monitor and optimize AI/ML models to ensure their accuracy, reliability, and performance in production environments\nStay up-to-date with the latest advancements in AI/ML technologies and apply them to drive innovation and maintain a competitive edge\nLead projects with both hands-on coding/analysis and thought leadership with a minimum viable product and minimum lovable product mindset leveraging the best technologies and methodologies appropriate for the business need and maturity\nProactively identify and communicate the challenges, opportunities, risks, and threats associated with project work to ensure the timely completion of the entire product\nA dynamic, innovative, and collaborative work environment that fosters creativity and encourages out-of-the-box thinking\nOpportunity to work on cutting-edge AI/ML projects that make a measurable impact on our products and to our customers\nAccess to state-of-the-art technology, tools, and resources to support your work and professional development\nMentorship from experienced AI/ML professionals who are leaders in their field and dedicated to helping you grow and succeed\nCollaborative opportunities with cross-functional teams, allowing you to expand your skills and knowledge across various domains\nContinuous learning and development opportunities, including workshops, conferences, and training programs to keep you updated with the latest advancements in AI/ML\nFlexible work arrangements that promote work-life balance and support your personal and professional well-being\nCompetitive compensation package\nBe part of a collaborative, inclusive, and supportive team that values diversity, integrity, and excellence\nEnjoy a culture that promotes work-life balance, fosters continuous learning, and celebrates individual and collective achievements\nA diverse and inclusive workplace that values and celebrates individual differences and fosters a sense of belonging\nMaster's degree in Computer Science, Statistics, Mathematics, or a related quantitative field (we will consider exceptional candidates without advanced degrees)\n8+ years of hands-on experience in developing and deploying AI/ML models in a production environment\nExperience operating as a technical lead\nStrong expertise in machine learning algorithms, deep learning frameworks (e.g., TensorFlow, PyTorch), and statistical modeling techniques\nExtremely experienced in programming languages such as Python, R, and SQL for data manipulation and analysis\nExperience with end-to-end feature development (owning feature definition, roadmap development, and experimentation)\nExperience distilling informal customer requirements into problem definitions, dealing with ambiguity, and competing objectives\nExperience with big data technologies (e.g., Snowflake, Google BigQuery) and cloud computing platforms (e.g., AWS, GCP, Azure)\nExcellent problem-solving skills and ability to think creatively to develop innovative AI/ML solutions\nStrong communication and collaboration skills to effectively work with cross-functional teams and stakeholders\nProven track record of delivering high-impact AI/ML projects in a fast-paced and dynamic environment\nDemonstrated ability to persevere and iterate through solutions in the face of technical challenges and setbacks\nHands-on experience in building solutions leveraging the latest AI capabilities and advancements, including large language models, generative AI, and other state-of-the-art techniques",
            "location": "Deerfield, IL"
        },
        {
            "title": "Customer Engineer, AI/ML, HCLS, Google Cloud",
            "company": "Google",
            "link": "https://www.linkedin.com/jobs/view/customer-engineer-ai-ml-hcls-google-cloud-at-google-4191598080?position=7&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=wNAuswmd33heNGgb6ONEFw%3D%3D",
            "posted time": "1 week ago",
            "description": "Bachelor's degree or equivalent practical experience.\n6 years of experience with cloud native architecture in a customer-facing or support role.\nExperience engaging with, and presenting to, technical stakeholders and executive leader.\nExperience with Machine Learning model development and deployment.\nExperience with frameworks for deep learning (e.g. PyTorch, Tensorflow, Jax, Ray, etc.) and using machine learning APIs.\nMaster's degree in Computer Science, Engineering, Mathematics, a technical field, or equivalent practical experience.\nExperience in building machine learning solutions and leveraging specific machine learning architectures (e.g. deep learning, LSTM, convolutional networks).\nExperience in architecting and developing software or infrastructure for scalable, distributed systems.\nExperience in data and information management as it relates to big data trends and issues within businesses.\nAbility to learn quickly, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT technology space.\nWork with the team to identify and qualify business opportunities, understand key customer technical objections, and develop the strategy to resolve technical blockers.\nShare AI/ML expertise to support the technical relationship with customers, including technology advocacy, supporting bid responses, product and solution briefings, proof-of-concept work, and partnering directly with product management to prioritize solutions impacting customer adoption to Google Cloud.\nWork directly with Google Cloud products to demonstrate and prototype integrations in customer and partner environments.\nRecommend integration strategies, enterprise architectures, platforms, and application infrastructure to implement a complete solution on Google Cloud.\nTravel to customer sites, conferences, and other related events as needed, acting as a public advocate for Google Cloud.",
            "location": "Chicago, IL"
        },
        {
            "title": "Senior Machine Learning Engineer I",
            "company": "Walgreens",
            "link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-i-at-walgreens-4093521112?position=8&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=OqvBhRs7ow5hh9qvzbu34A%3D%3D",
            "posted time": "4 days ago",
            "description": "Develops software that processes, stores and serves data and machine learning models for use by others.\nDevelops large scale data structures and pipelines to organize, collect and standardize data that helps generate insights and intelligence to support business needs.\nWrites ETL (Extract / Transform / Load) or ELT processes, designs data stores and develops tools for real-time and offline analytic processing on premise or on cloud infrastructure.\nDevelops and maintains optimal data pipelines into the ML and advanced analytics platform, including design of data flows, procedures, and schedules. Ensures that optimal data pipelines are scalable, repeatable and secure.\nTroubleshoots software and processes for data consistency and integrity. Integrates data from a variety of sources, assuring that they adhere to data quality and accessibility standards.\nAnticipates and prevents problems and roadblocks before they occur.\nInteracts with internal and external peers and managers to exchange complex information related to areas of specialization.\nCollaborates with AI/ML scientists and data scientists to prepare data for model development, and to deploy models to production.\nBachelor's degree and at least 4 years of experience in machine learning, software engineering, or data engineering\nDeep knowledge of SQL\nSignificant experience programming in one or more of the following: Python, C, C++, Spark, Scala, and/or Java\nExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and external (business community, clients and vendors) within a matrix organization to ensure quality standards for service.\nExperience diagnosing, isolating, and resolving complex business issues and recommending and implementing strategies to resolve problems.\nExperience presenting to all levels of an organization\nAt least 2 years of experience contributing to financial decisions in the workplace\nAt least 2 years of direct leadership, indirect leadership and/or cross-functional team leadership\nWilling to travel up to 10% of the time for business purposes (within state and out of state).\nGraduate degree in a technical discipline and at least 2 years of experience in machine learning, software engineering, or data engineering.\nStrong experience designing and implementing monitoring and alerting systems for cloud-based applications, including log management and analysis tools (e.g., ELK stack, Splunk).\nExperience with cloud platforms (AWS, Azure, GCP) and their AI/ML services, as well as deploying ML models at scale in production using open-source tools (e.g., Kubeflow, Seldon).\nProficiency in CI/CD practices for AI/ML model development and deployment, with experience using tools such as Azure DevOps, Tekton, or GitHub Actions.\nExperience with Infrastructure as Code (IaC) tools, particularly Terraform.\nFamiliarity with DAG-based workflow orchestration systems (e.g., Airflow, Prefect) and data processing pipelines using Apache Spark or Databricks.\nExperience working with ML registries (e.g., MLFlow) and deploying event-driven or reactive ML applications.\nStrong background in deploying and maintaining ML systems for both batch and streaming data.\nExpertise in troubleshooting distributed systems, optimizing performance, and reducing costs in cloud environments.\nProficient in writing and deploying production-grade Python applications and libraries.\nExperience with REST API development and configuring Kubernetes in multi-tenant environments.\nBachelor's degree and at least 4 years of experience in machine learning, software engineering, or data engineering\nDeep knowledge of SQL\nSignificant experience programming in one or more of the following: Python, C, C++, Spark, Scala, and/or Java\nExperience establishing and maintaining key relationships with internal (peers, business partners and leadership) and external (business community, clients and vendors) within a matrix organization to ensure quality standards for service.\nExperience diagnosing, isolating, and resolving complex business issues and recommending and implementing strategies to resolve problems.\nExperience presenting to all levels of an organization\nAt least 2 years of experience contributing to financial decisions in the workplace\nAt least 2 years of direct leadership, indirect leadership and/or cross-functional team leadership\nWilling to travel up to 10% of the time for business purposes (within state and out of state).\nGraduate degree in a technical discipline and at least 2 years of experience in machine learning, software engineering, or data engineering.\nStrong experience designing and implementing monitoring and alerting systems for cloud-based applications, including log management and analysis tools (e.g., ELK stack, Splunk).\nExperience with cloud platforms (AWS, Azure, GCP) and their AI/ML services, as well as deploying ML models at scale in production using open-source tools (e.g., Kubeflow, Seldon).\nProficiency in CI/CD practices for AI/ML model development and deployment, with experience using tools such as Azure DevOps, Tekton, or GitHub Actions.\nExperience with Infrastructure as Code (IaC) tools, particularly Terraform.\nFamiliarity with DAG-based workflow orchestration systems (e.g., Airflow, Prefect) and data processing pipelines using Apache Spark or Databricks.\nExperience working with ML registries (e.g., MLFlow) and deploying event-driven or reactive ML applications.\nStrong background in deploying and maintaining ML systems for both batch and streaming data.\nExpertise in troubleshooting distributed systems, optimizing performance, and reducing costs in cloud environments.\nProficient in writing and deploying production-grade Python applications and libraries.\nExperience with REST API development and configuring Kubernetes in multi-tenant environments.",
            "location": "Deerfield, IL"
        },
        {
            "title": "Data Scientist II",
            "company": "HNTB",
            "link": "https://www.linkedin.com/jobs/view/data-scientist-ii-at-hntb-4194443105?position=9&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=CcSFPnfn63bXvDtos6qdow%3D%3D",
            "posted time": "1 week ago",
            "description": "Provides insight into leading analytics practices.\nDesigns and leads iterative learning and development cycles.\nProduces new and creative analytic solutions that will become core work you’re doing.\nDevelops proficiency with data mining, cleaning, aggregation techniques.\nWorks with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions.\nMines and analyzes large datasets, draws insights from data using statistical techniques.\nDevelops custom data models and algorithms to apply to data sets.\nUses predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes.\nDevelops company A/B testing framework and test model quality.\nCoordinate with different functional teams to implement models and monitor outcomes.\nPerforms other duties as assigned.\nBachelor’s degree in data science, statistics, computer science, computer engineering, or information systems and 3 years of relevant experience, or\nMaster’s degree in data science, statistics, computer science, computer engineering, or information systems and 2 years of relevant experience, or\nIn lieu of education, 7 years of relevant experience\nDesign, develop, and implement leading-edge data sciences models, segmentation, anomaly detection, and optimization solutions.\nDevelop, train, and apply AI and ML solutions to real-world problems.\nEffectively communicate data analysis, modeling methodology, and results to internal partners and client teams.\nWork on data sciences projects from inception through completion including, but not limited to, data evaluation, methodology design, data cleansing, data wrangling, feature engineering, processing optimization, results interpretation, and client communication.\nConduct data engineering to enable rigorous analysis of data\nCoordinate with developers, quality assurance teams, and users to test processes and ensure functionality and user acceptance.\nSupport project managers to coordinate resources and ensure projects are delivered on time and on budget, with quality, to the customer's satisfaction.\nPerform other duties as assigned.\nExperience as a data scientist or data engineer utilizing languages such as Python, R, SQL, Scala, and Java\nExperience visualizing/presenting data for stakeholders using Power BI, Tableau, or similar tools\nExperience working in a consulting environment\nBachelor's degree in Data Sciences, Economics, Statistics, Mathematics, or Engineering\nMaster’s degree in Data Sciences, Computer Science, Mathematics, Statistics, Economics, or appropriate field.\nTransportation Industry experience\nConsulting experience\nAbility to travel",
            "location": "Chicago, IL"
        },
        {
            "title": "Software Engineer - Python",
            "company": "CPS, Inc.",
            "link": "https://www.linkedin.com/jobs/view/software-engineer-python-at-cps-inc-4158726357?position=10&pageNum=4&refId=4uF5hiflPnaWk97xkRX%2F3g%3D%3D&trackingId=7it6ImIKd8qt6r%2FQvBXSeg%3D%3D",
            "posted time": "1 day ago",
            "description": "Sorry, we are unable to offer any sponsorship or visa transfers\nPython (1 year)\nC++ or C# (1 year)\nJavaScript or React experience on the front-end\nFinancial industry experience (professional, internship, or a desire to work within the financial sector)",
            "location": "Chicago, IL"
        }
    ]
}